<?php
header('Content-Type: text/html;charset=utf-8');
include_once dirname(__FILE__) . '/bz.php';//八字定义
include_once dirname(__FILE__) . '/function.php';//未修改的方法
include_once dirname(__FILE__) . '/astro.php';//星座的方法
global $a;
/*活取现在年份  */
function getYear ()
{
    return date('Y');
}
/*12个月份  */
function months(){
    $months=array();
    for($j=1;$j<=12;$j++){
        $months[]=$j;
    }
    return $months;
}
/*31天  */
function days(){
    $days=array();
    for ($i=1;$i<=31;$i++){
        $days[]=$i;
    }
    return $days;
}
/*24小时  */
function hours(){
    $hours=array();
    for($j=0;$j<24;$j++){
        $hours[]=$j;
    }
    return $hours;
}
/* 60分钟 */
function mins(){
    $mins=array();
    for($j=1;$j<=60;$j++){
        $mins[]=$j;
    }
    return $mins;
}
/* 判断session 传统算命除血型以外都要填写*/
  function checkSession () {
    $checkSession = $_SESSION ['xing'] != "" &&
    $_SESSION ['ming'] != "" &&
    $_SESSION ['xingbie'] != "" &&
    $_SESSION ['nian'] != "" &&
    $_SESSION ['yue'] != "" &&
    $_SESSION ['ri'] != "" &&
    $_SESSION ['hh'] != "";
    return $checkSession;
}
/*调用资料  */
function get_xing(){

    return $_SESSION['xing'];
}
function get_ming(){
    return $_SESSION['ming'];
}
function get_xingbie(){
    return $_SESSION['xingbie'];
}
function get_xuexing(){
    return $_SESSION['xuexing'];
}
function get_nian(){
    return $_SESSION['nian'];
}
function get_yue(){
    return $_SESSION['yue'];
}
function get_ri(){
    return $_SESSION['ri'];
}
function get_hh(){
    return $_SESSION['hh'];
}
function get_mm(){
    return $_SESSION['mm'];
}
/*重新算命（销毁session）*/
function _restart(){
    session_destroy();
}
/* 时间格式 */
function caltime(){
    $caltime=$_SESSION['nian'].
    "-".$_SESSION['yue']."-".$_SESSION['ri'].' '.$_SESSION['hh'].":".$_SESSION['mm'].":"."0";
    return $caltime;
}
function hhcal($caltime)
{

    //获取当前系统时间
    $curTime = strtotime($caltime) ;
    //星期名
    $WeekName = array("星期日", "星期一", "星期二", "星期三", "星期四", "星期五" , "星期六" );
    //天干名称
    $TianGan = array("甲", "乙", "丙" , "丁" , "戊", "己", "庚", "辛", "壬", "癸");
    //地支名称
    $DiZhi = array("子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥");
    //属相名称
    $ShuXiang = array("鼠", "牛", "虎", "兔", "龙", "蛇", "马", "羊", "猴", "鸡", "狗", "猪" );
    //农历日期名
    $DayName = array("*", "初一", "初二" ,"初三", "初四" , "初五" , "初六" , "初七" , "初八" , "初九" , "初十" , "十一" , "十二" , "十三" , "十四" , "十五" , "十六" , "十七" , "十八" , "十九" , "二十" , "廿一" , "廿二", "廿三", "廿四" , "廿五" , "廿六" , "廿七" , "廿八" , "廿九" , "三十" );
    //农历月份名
    $MonName = array("*", "正", "二", "三", "四", "五", "六", "七", "八", "九", "十", "十一", "腊");
    //公历每月前面的天数
    $MonthAdd = array(0, 31, 59, 90, 120, 151, 181, 212, 243, 273, 304, 334);
    //农历数据
    $NongliData = array(2635 , 333387 , 1701 , 1748 , 267701 , 694 , 2391 , 133423 , 1175 , 396438 , 3402 , 3749 , 331177 , 1453 , 694 , 201326 , 2350 , 465197 , 3221 , 3402 , 400202 , 2901 , 1386 , 267611 , 605 , 2349 , 137515 , 2709 , 464533 , 1738 , 2901 , 330421 , 1242 , 2651 , 199255 , 1323 , 529706 , 3733 , 1706 , 398762 , 2741 , 1206 , 267438 , 2647 , 1318 , 204070 , 3477 , 461653 , 1386 , 2413 , 330077 , 1197 , 2637 , 268877 , 3365 , 531109 , 2900 , 2922 , 398042 , 2395 , 1179 , 267415 , 2635 , 661067 , 1701 , 1748 , 398772 , 2742 , 2391 , 330031 , 1175 , 1611 , 200010 , 3749 , 527717 , 1452 , 2742 , 332397 , 2350 , 3222 , 268949 , 3402 , 3493 , 133973 , 1386 , 464219 , 605 , 2349 , 334123 , 2709 , 2890 , 267946 , 2773 , 592565 , 1210 , 2651 , 395863 , 1323 , 2707 , 265877 );
    //生成当前公历年、月、日 ==> GongliStr
    $curYear = date("Y", $curTime);
    $curMonth = date("n", $curTime) ;
    $curDay = date("j", $curTime) ;
    $GongliStr = $curYear . "年" . $curMonth . "月" . $curDay . "日";

    //生成当前公历星期 ==> WeekdayStr
    $curWeekday = date('w', $curTime) ;
    $WeekdayStr = $WeekName[$curWeekday];

    //计算到初始时间1921年2月8日的天数：1921-2-8(正月初一)
    $TheDate = ($curYear - 1921) * 365 + intval(($curYear - 1921) / 4) + $curDay + $MonthAdd[intval($curMonth) - 1] - 38 ;
    if (($curYear%4) == 0 && $curMonth > 2){
        $TheDate = $TheDate + 1;
    }

    //计算农历天干、地支、月、日
    $isEnd = 0 ;
    $m = 0 ;
    do{
        if ($NongliData[$m] < 4095) {
            $k = 11 ;
        } else {
            $k = 12 ;
        }
        $n = $k ;
        do{
            if ($n < 0) {
                break;
            }
            //获取NongliData(m)的第n个二进制位的值
            $bit = $NongliData[$m];
            for($i=0; $i<$n; $i++) {
                $bit = intval($bit / 2);
            }
            $bit = $bit%2;
            if ($TheDate <= 29 + $bit){
                $isEnd = 1 ;
                break;
            }
            $TheDate = $TheDate - 29 - $bit;
            $n--;
        } while (true);

        if ($isEnd == 1) {
            break;
        }
        $m++;
    } while (true);
    $curYear = 1921 + $m ;
    $curMonth = $k - $n + 1 ;
    $curDay = $TheDate ;
    if ($k == 12) {
        if ($curMonth == intval($NongliData[$m] / 65536) + 1) {
            $curMonth = 1 - $curMonth ;
        }
        elseif ($curMonth > intval($NongliData[$m] / 65536) + 1) {
            $curMonth = $curMonth - 1 ;
        }
    }

    //生成农历天干、地支、属相 ==> NongliStr
    $nlnian = $TianGan[((($curYear - 4)%60)%10)] . $DiZhi[((($curYear - 4)%60)%12)];
    $sx = $ShuXiang[((($curYear - 4)%60)%12)];
    //生成农历月、日 ==> NongliDayStr
    if ($curMonth < 1) {
        $nlyue = $MonName[-1 * $curMonth] ;
    }
    else  {
        $nlyue = $MonName[$curMonth];
    }
    $nlri = $DayName[$curDay];
    $nonglistr= $nlnian . "|" . $nlyue . "|" . $nlri . "|" . $sx;
    return $nonglistr;
}

/*纳音*/
function layin($tgdz)
{

    $user=M('jiazi');
    $rs=$user->where(array('jiazi'=>$tgdz))->select();
    if(false!==$rs){
        return $rs[0]['layin'];
    }
    else {

    return '';
    }
}
/* 五行 */
function wuxing($dg)
{

    $user=M('wh');
    $rs=$user->where(array('wh'=>$dg))->select();
    if(false!==$rs){
        return $rs;
    }
    else {

        return '';
    }
}
/* 四季用神参考  */
function sjrs($wh,$sj)
{

    $user=M('sjrs');
    $rs=$user->where(array('wh'=>$wh,'sj'=>$sj))->select();
    if(false!==$rs){
        return $rs;
    }
    else {

        return '';
    }
}
/*  穷通宝鉴调候用神参考*/
function qtbj($dg,$mz){
   /*   $sql="select * from qtbj where tg=? and dz=?";
    $db->query($sql, array($dg1, $mz1));
    if($rs = $db->fetchArray()) {
        $smarty->assign('qtbj' , $rs['content']);
    } */
    $user=M('qtbj');
    $rs=$user->where(array('tg'=>$dg,'dz'=>$mz))->select();
    if(false!==$rs){
        return $rs;
    }
    else {

        return '';
    }

}
/* 生肖个性 */

function sxgx($sx){
    $user=M('sxgx');
    $rs=$user->where(array('sx'=>$sx))->select();
    if(false!==$rs){
        return $rs;
    }
    else {

        return '';
    }

}
/* 日干算命 */
function rgnm($dgz){
        $user=M('rgnm');
        $rs=$user->where(array('rgz'=>$dgz))->select();
        if(false!==$rs){
            return $rs;
        }
        else {

            return '';
        }

}
/* 称骨算命 */
function cglm($nian1,$yue2,$ri2,$hh2){
    //'年
    $user=M('chenggu1');
    $rs1=$user->where(array('year'=>$nian1))->select();
    $weight1=$rs1[0][weight];
   //月
    $user=M('chenggu2');
    $rs2=$user->where(array('month'=>$yue2))->select();
    $weight2=$rs2[0][weight];
    //日
    $user=M('chenggu3');
    $rs3=$user->where(array('day'=>$ri2))->select();
    $weight3=$rs3[0][weight];
    //时
    $user=M('chenggu4');
    $rs4=$user->where(array('time'=>$hh2))->select();
    $weight4=$rs4[0][weight];
    $weight=$weight1+$weight2+$weight3+$weight4;//总量
    $tempweight=intval($weight*10);
  /*最终结果  */
    $user=M('chenggu');
    $tempweight=intval($weight*10);
    $rs=$user->where(array('weight'=>$tempweight))->select();
    $cglm=array($weight,$rs[0][content],$rs[0][intro]);
    return $cglm;

}
/*得到一个汉字字意五行*/
function getzywh($txt)
{
    if ($txt!=""){
$user=M('hzwh');
    $map['hz']=array('like','%'.$txt.'%');
    $rs = $user->where($map)->select();
if(null !== $rs){
    return $rs[0]['wh'];
}
else {
    return 0;
}
    }

  else return "";
    }
/*-天地人格算命*/
    function sancaism($str){
        $user=M('81');
        $rs=$user->where(array('num'=>$str))->select();
        if(false!==$rs){
            return $rs;

        }
        else {

            return '';
        }
    }
//'三才吉凶
function getpf($sc)
    {
        $arr = array("大吉" =>12, "吉"=>8, "半吉"=>5, "大凶"=> 0, "凶"=> 1, "半凶"=> 2, "平"=>4);
        return $arr[$sc];
    }
function sancaijx($sancai){
    $user=M('sancai');
$rs=$user->where(array('title'=>$sancai))->select();
        if(false!==$rs){
            return $rs;
        }
        else {

            return '';
        }
    }

/*字转拼音  */
function pin($num)
{
    static $d = array(
        "a" => -20319
        ,"ai" => -20317
        ,"an" => -20304
        ,"ang" => -20295
        ,"ao" => -20292
        ,"ba" => -20283
        ,"bai" => -20265
        ,"ban" => -20257
        ,"bang" => -20242
        ,"bao" => -20230
        ,"bei" => -20051
        ,"ben" => -20036
        ,"beng" => -20032
        ,"bi" => -20026
        ,"bian" => -20002
        ,"biao" => -19990
        ,"bie" => -19986
        ,"bin" => -19982
        ,"bing" => -19976
        ,"bo" => -19805
        ,"bu" => -19784
        ,"ca" => -19775
        ,"cai" => -19774
        ,"can" => -19763
        ,"cang" => -19756
        ,"cao" => -19751
        ,"ce" => -19746
        ,"ceng" => -19741
        ,"cha" => -19739
        ,"chai" => -19728
        ,"chan" => -19725
        ,"chang" => -19715
        ,"chao" => -19540
        ,"che" => -19531
        ,"chen" => -19525
        ,"cheng" => -19515
        ,"chi" => -19500
        ,"chong" => -19484
        ,"chou" => -19479
        ,"chu" => -19467
        ,"chuai" => -19289
        ,"chuan" => -19288
        ,"chuang" => -19281
        ,"chui" => -19275
        ,"chun" => -19270
        ,"chuo" => -19263
        ,"ci" => -19261
        ,"cong" => -19249
        ,"cou" => -19243
        ,"cu" => -19242
        ,"cuan" => -19238
        ,"cui" => -19235
        ,"cun" => -19227
        ,"cuo" => -19224
        ,"da" => -19218
        ,"dai" => -19212
        ,"dan" => -19038
        ,"dang" => -19023
        ,"dao" => -19018
        ,"de" => -19006
        ,"deng" => -19003
        ,"di" => -18996
        ,"dian" => -18977
        ,"diao" => -18961
        ,"die" => -18952
        ,"ding" => -18783
        ,"diu" => -18774
        ,"dong" => -18773
        ,"dou" => -18763
        ,"du" => -18756
        ,"duan" => -18741
        ,"dui" => -18735
        ,"dun" => -18731
        ,"duo" => -18722
        ,"e" => -18710
        ,"en" => -18697
        ,"er" => -18696
        ,"fa" => -18526
        ,"fan" => -18518
        ,"fang" => -18501
        ,"fei" => -18490
        ,"fen" => -18478
        ,"feng" => -18463
        ,"fo" => -18448
        ,"fou" => -18447
        ,"fu" => -18446
        ,"ga" => -18239
        ,"gai" => -18237
        ,"gan" => -18231
        ,"gang" => -18220
        ,"gao" => -18211
        ,"ge" => -18201
        ,"gei" => -18184
        ,"gen" => -18183
        ,"geng" => -18181
        ,"gong" => -18012
        ,"gou" => -17997
        ,"gu" => -17988
        ,"gua" => -17970
        ,"guai" => -17964
        ,"guan" => -17961
        ,"guang" => -17950
        ,"gui" => -17947
        ,"gun" => -17931
        ,"guo" => -17928
        ,"ha" => -17922
        ,"hai" => -17759
        ,"han" => -17752
        ,"hang" => -17733
        ,"hao" => -17730
        ,"he" => -17721
        ,"hei" => -17703
        ,"hen" => -17701
        ,"heng" => -17697
        ,"hong" => -17692
        ,"hou" => -17683
        ,"hu" => -17676
        ,"hua" => -17496
        ,"huai" => -17487
        ,"huan" => -17482
        ,"huang" => -17468
        ,"hui" => -17454
        ,"hun" => -17433
        ,"huo" => -17427
        ,"ji" => -17417
        ,"jia" => -17202
        ,"jian" => -17185
        ,"jiang" => -16983
        ,"jiao" => -16970
        ,"jie" => -16942
        ,"jin" => -16915
        ,"jing" => -16733
        ,"jiong" => -16708
        ,"jiu" => -16706
        ,"ju" => -16689
        ,"juan" => -16664
        ,"jue" => -16657
        ,"jun" => -16647
        ,"ka" => -16474
        ,"kai" => -16470
        ,"kan" => -16465
        ,"kang" => -16459
        ,"kao" => -16452
        ,"ke" => -16448
        ,"ken" => -16433
        ,"keng" => -16429
        ,"kong" => -16427
        ,"kou" => -16423
        ,"ku" => -16419
        ,"kua" => -16412
        ,"kuai" => -16407
        ,"kuan" => -16403
        ,"kuang" => -16401
        ,"kui" => -16393
        ,"kun" => -16220
        ,"kuo" => -16216
        ,"la" => -16212
        ,"lai" => -16205
        ,"lan" => -16202
        ,"lang" => -16187
        ,"lao" => -16180
        ,"le" => -16171
        ,"lei" => -16169
        ,"leng" => -16158
        ,"li" => -16155
        ,"lia" => -15959
        ,"lian" => -15958
        ,"liang" => -15944
        ,"liao" => -15933
        ,"lie" => -15920
        ,"lin" => -15915
        ,"ling" => -15903
        ,"liu" => -15889
        ,"long" => -15878
        ,"lou" => -15707
        ,"lu" => -15701
        ,"lv" => -15681
        ,"luan" => -15667
        ,"lue" => -15661
        ,"lun" => -15659
        ,"luo" => -15652
        ,"ma" => -15640
        ,"mai" => -15631
        ,"man" => -15625
        ,"mang" => -15454
        ,"mao" => -15448
        ,"me" => -15436
        ,"mei" => -15435
        ,"men" => -15419
        ,"meng" => -15416
        ,"mi" => -15408
        ,"mian" => -15394
        ,"miao" => -15385
        ,"mie" => -15377
        ,"min" => -15375
        ,"ming" => -15369
        ,"miu" => -15363
        ,"mo" => -15362
        ,"mou" => -15183
        ,"mu" => -15180
        ,"na" => -15165
        ,"nai" => -15158
        ,"nan" => -15153
        ,"nang" => -15150
        ,"nao" => -15149
        ,"ne" => -15144
        ,"nei" => -15143
        ,"nen" => -15141
        ,"neng" => -15140
        ,"ni" => -15139
        ,"nian" => -15128
        ,"niang" => -15121
        ,"niao" => -15119
        ,"nie" => -15117
        ,"nin" => -15110
        ,"ning" => -15109
        ,"niu" => -14941
        ,"nong" => -14937
        ,"nu" => -14933
        ,"nv" => -14930
        ,"nuan" => -14929
        ,"nue" => -14928
        ,"nuo" => -14926
        ,"o" => -14922
        ,"ou" => -14921
        ,"pa" => -14914
        ,"pai" => -14908
        ,"pan" => -14902
        ,"pang" => -14894
        ,"pao" => -14889
        ,"pei" => -14882
        ,"pen" => -14873
        ,"peng" => -14871
        ,"pi" => -14857
        ,"pian" => -14678
        ,"piao" => -14674
        ,"pie" => -14670
        ,"pin" => -14668
        ,"ping" => -14663
        ,"po" => -14654
        ,"pu" => -14645
        ,"qi" => -14630
        ,"qia" => -14594
        ,"qian" => -14429
        ,"qiang" => -14407
        ,"qiao" => -14399
        ,"qie" => -14384
        ,"qin" => -14379
        ,"qing" => -14368
        ,"qiong" => -14355
        ,"qiu" => -14353
        ,"qu" => -14345
        ,"quan" => -14170
        ,"que" => -14159
        ,"qun" => -14151
        ,"ran" => -14149
        ,"rang" => -14145
        ,"rao" => -14140
        ,"re" => -14137
        ,"ren" => -14135
        ,"reng" => -14125
        ,"ri" => -14123
        ,"rong" => -14122
        ,"rou" => -14112
        ,"ru" => -14109
        ,"ruan" => -14099
        ,"rui" => -14097
        ,"run" => -14094
        ,"ruo" => -14092
        ,"sa" => -14090
        ,"sai" => -14087
        ,"san" => -14083
        ,"sang" => -13917
        ,"sao" => -13914
        ,"se" => -13910
        ,"sen" => -13907
        ,"seng" => -13906
        ,"sha" => -13905
        ,"shai" => -13896
        ,"shan" => -13894
        ,"shang" => -13878
        ,"shao" => -13870
        ,"she" => -13859
        ,"shen" => -13847
        ,"sheng" => -13831
        ,"shi" => -13658
        ,"shou" => -13611
        ,"shu" => -13601
        ,"shua" => -13406
        ,"shuai" => -13404
        ,"shuan" => -13400
        ,"shuang" => -13398
        ,"shui" => -13395
        ,"shun" => -13391
        ,"shuo" => -13387
        ,"si" => -13383
        ,"song" => -13367
        ,"sou" => -13359
        ,"su" => -13356
        ,"suan" => -13343
        ,"sui" => -13340
        ,"sun" => -13329
        ,"suo" => -13326
        ,"ta" => -13318
        ,"tai" => -13147
        ,"tan" => -13138
        ,"tang" => -13120
        ,"tao" => -13107
        ,"te" => -13096
        ,"teng" => -13095
        ,"ti" => -13091
        ,"tian" => -13076
        ,"tiao" => -13068
        ,"tie" => -13063
        ,"ting" => -13060
        ,"tong" => -12888
        ,"tou" => -12875
        ,"tu" => -12871
        ,"tuan" => -12860
        ,"tui" => -12858
        ,"tun" => -12852
        ,"tuo" => -12849
        ,"wa" => -12838
        ,"wai" => -12831
        ,"wan" => -12829
        ,"wang" => -12812
        ,"wei" => -12802
        ,"wen" => -12607
        ,"weng" => -12597
        ,"wo" => -12594
        ,"wu" => -12585
        ,"xi" => -12556
        ,"xia" => -12359
        ,"xian" => -12346
        ,"xiang" => -12320
        ,"xiao" => -12300
        ,"xie" => -12120
        ,"xin" => -12099
        ,"xing" => -12089
        ,"xiong" => -12074
        ,"xiu" => -12067
        ,"xu" => -12058
        ,"xuan" => -12039
        ,"xue" => -11867
        ,"xun" => -11861
        ,"ya" => -11847
        ,"yan" => -11831
        ,"yang" => -11798
        ,"yao" => -11781
        ,"ye" => -11604
        ,"yi" => -11589
        ,"yin" => -11536
        ,"ying" => -11358
        ,"yo" => -11340
        ,"yong" => -11339
        ,"you" => -11324
        ,"yu" => -11303
        ,"yuan" => -11097
        ,"yue" => -11077
        ,"yun" => -11067
        ,"za" => -11055
        ,"zai" => -11052
        ,"zan" => -11045
        ,"zang" => -11041
        ,"zao" => -11038
        ,"ze" => -11024
        ,"zei" => -11020
        ,"zen" => -11019
        ,"zeng" => -11018
        ,"zha" => -11014
        ,"zhai" => -10838
        ,"zhan" => -10832
        ,"zhang" => -10815
        ,"zhao" => -10800
        ,"zhe" => -10790
        ,"zhen" => -10780
        ,"zheng" => -10764
        ,"zhi" => -10587
        ,"zhong" => -10544
        ,"zhou" => -10533
        ,"zhu" => -10519
        ,"zhua" => -10331
        ,"zhuai" => -10329
        ,"zhuan" => -10328
        ,"zhuang" => -10322
        ,"zhui" => -10315
        ,"zhun" => -10309
        ,"zhuo" => -10307
        ,"zi" => -10296
        ,"zong" => -10281
        ,"zou" => -10274
        ,"zu" => -10270
        ,"zuan" => -10262
        ,"zui" => -10260
        ,"zun" => -10256
        ,"zuo" => -10254 );

    $aa = array_values($d);
    $b = array_keys($d);

    if($num>0 && $num<160) {
        return chr($num);
    }
    if($num<-20319 || $num>-10247){
        return '';
    }
    $k=count($aa);
    while($k--){
        if($aa[$k]<=$num){
            break;
        }
    }
    return $b[$k];
}
 function pinyin($str)
{
    $c="" ;
    $strLen = strlen($str);
    for($k=0; $k<$strLen; $k++){
        $charCode = ord(substr($str, $k, 1));
        if($charCode>=0x80 && $charCode<=0xFF) {
            $charLowCode = ord(substr($str, ++$k, 1));
            $charCode = $charCode*256 + $charLowCode - 65536;

        }
        $c .= pin($charCode);
/* error */
    }
    return $c;

}
/* 简体转换繁体 */
function GbToBig($content)
{
    $s="阳,皑,蔼,碍,爱,翱,袄,奥,坝,罢,摆,败,颁,办,绊,帮,绑,镑,谤,剥,饱,宝,报,鲍,辈,贝,钡,狈,备,惫,绷,笔,毕,毙,闭,边,编,贬,变,辩,辫,鳖,瘪,濒,滨,宾,摈,饼,拨,钵,铂,驳,卜,补,参,蚕,残,惭,惨,灿,苍,舱,仓,沧,厕,侧,册,测,层,诧,搀,掺,蝉,馋,谗,缠,铲,产,阐,颤,场,尝,长,偿,肠,厂,畅,钞,车,彻,尘,陈,衬,撑,称,惩,诚,骋,痴,迟,驰,耻,齿,炽,冲,虫,宠,畴,踌,筹,绸,丑,橱,厨,锄,雏,础,储,触,处,传,疮,闯,创,锤,纯,绰,辞,词,赐,聪,葱,囱,从,丛,凑,窜,错,达,带,贷,担,单,郸,掸,胆,惮,诞,弹,当,挡,党,荡,档,捣,岛,祷,导,盗,灯,邓,敌,涤,递,缔,点,垫,电,淀,钓,调,迭,谍,叠,钉,顶,锭,订,东,动,栋,冻,斗,犊,独,读,赌,镀,锻,断,缎,兑,队,对,吨,顿,钝,夺,鹅,额,讹,恶,饿,儿,尔,饵,贰,发,罚,阀,珐,矾,钒,烦,范,贩,饭,访,纺,飞,废,费,纷,坟,奋,愤,粪,丰,枫,锋,风,疯,冯,缝,讽,凤,肤,辐,抚,辅,赋,复,负,讣,妇,缚,该,钙,盖,干,赶,秆,赣,冈,刚,钢,纲,岗,皋,镐,搁,鸽,阁,铬,个,给,龚,宫,巩,贡,钩,沟,构,购,够,蛊,顾,剐,关,观,馆,惯,贯,广,规,硅,归,龟,闺,轨,诡,柜,贵,刽,辊,滚,锅,国,过,骇,韩,汉,阂,鹤,贺,横,轰,鸿,红,后,壶,护,沪,户,哗,华,画,划,话,怀,坏,欢,环,还,缓,换,唤,痪,焕,涣,黄,谎,挥,辉,毁,贿,秽,会,烩,汇,讳,诲,绘,荤,浑,伙,获,货,祸,击,机,积,饥,讥,鸡,绩,缉,极,辑,级,挤,几,蓟,剂,济,计,记,际,继,纪,夹,荚,颊,贾,钾,价,驾,歼,监,坚,笺,间,艰,缄,茧,检,碱,硷,拣,捡,简,俭,减,荐,槛,鉴,践,贱,见,键,舰,剑,饯,渐,溅,涧,浆,蒋,桨,奖,讲,酱,胶,浇,骄,娇,搅,铰,矫,侥,脚,饺,缴,绞,轿,较,秸,阶,节,茎,惊,经,颈,静,镜,径,痉,竞,净,纠,厩,旧,驹,举,据,锯,惧,剧,鹃,绢,杰,洁,结,诫,届,紧,锦,仅,谨,进,晋,烬,尽,劲,荆,觉,决,诀,绝,钧,军,骏,开,凯,颗,壳,课,垦,恳,抠,库,裤,夸,块,侩,宽,矿,旷,况,亏,岿,窥,馈,溃,扩,阔,蜡,腊,莱,来,赖,蓝,栏,拦,篮,阑,兰,澜,谰,揽,览,懒,缆,烂,滥,捞,劳,涝,乐,镭,垒,类,泪,篱,离,里,鲤,礼,丽,厉,励,砾,历,沥,隶,俩,联,莲,连,镰,怜,涟,帘,敛,脸,链,恋,炼,练,粮,凉,两,辆,谅,疗,辽,镣,猎,临,邻,鳞,凛,赁,龄,铃,凌,灵,岭,领,馏,刘,龙,聋,咙,笼,垄,拢,陇,楼,娄,搂,篓,芦,卢,颅,庐,炉,掳,卤,虏,鲁,赂,禄,录,陆,驴,吕,铝,侣,屡,缕,虑,滤,绿,峦,挛,孪,滦,乱,抡,轮,伦,仑,沦,纶,论,萝,罗,逻,锣,箩,骡,骆,络,妈,玛,码,蚂,马,骂,吗,买,麦,卖,迈,脉,瞒,馒,蛮,满,谩,猫,锚,铆,贸,么,霉,没,镁,门,闷,们,锰,梦,谜,弥,觅,绵,缅,庙,灭,悯,闽,鸣,铭,谬,谋,亩,钠,纳,难,挠,脑,恼,闹,馁,腻,撵,捻,酿,鸟,聂,啮,镊,镍,柠,狞,宁,拧,泞,钮,纽,脓,浓,农,疟,诺,欧,鸥,殴,呕,沤,盘,庞,国,爱,赔,喷,鹏,骗,飘,频,贫,苹,凭,评,泼,颇,扑,铺,朴,谱,脐,齐,骑,岂,启,气,弃,讫,牵,扦,钎,铅,迁,签,谦,钱,钳,潜,浅,谴,堑,枪,呛,墙,蔷,强,抢,锹,桥,乔,侨,翘,窍,窃,钦,亲,轻,氢,倾,顷,请,庆,琼,穷,趋,区,躯,驱,龋,颧,权,劝,却,鹊,让,饶,扰,绕,热,韧,认,纫,荣,绒,软,锐,闰,润,洒,萨,鳃,赛,伞,丧,骚,扫,涩,杀,纱,筛,晒,闪,陕,赡,缮,伤,赏,烧,绍,赊,摄,慑,设,绅,审,婶,肾,渗,声,绳,胜,圣,师,狮,湿,诗,尸,时,蚀,实,识,驶,势,释,饰,视,试,寿,兽,枢,输,书,赎,属,术,树,竖,数,帅,双,谁,税,顺,说,硕,烁,丝,饲,耸,怂,颂,讼,诵,擞,苏,诉,肃,虽,绥,岁,孙,损,笋,缩,琐,锁,獭,挞,抬,摊,贪,瘫,滩,坛,谭,谈,叹,汤,烫,涛,绦,腾,誊,锑,题,体,屉,条,贴,铁,厅,听,烃,铜,统,头,图,涂,团,颓,蜕,脱,鸵,驮,驼,椭,洼,袜,弯,湾,顽,万,网,韦,违,围,为,潍,维,苇,伟,伪,纬,谓,卫,温,闻,纹,稳,问,瓮,挝,蜗,涡,窝,呜,钨,乌,诬,无,芜,吴,坞,雾,务,误,锡,牺,袭,习,铣,戏,细,虾,辖,峡,侠,狭,厦,锨,鲜,纤,咸,贤,衔,闲,显,险,现,献,县,馅,羡,宪,线,厢,镶,乡,详,响,项,萧,销,晓,啸,蝎,协,挟,携,胁,谐,写,泻,谢,锌,衅,兴,汹,锈,绣,虚,嘘,须,许,绪,续,轩,悬,选,癣,绚,学,勋,询,寻,驯,训,讯,逊,压,鸦,鸭,哑,亚,讶,阉,烟,盐,严,颜,阎,艳,厌,砚,彦,谚,验,鸯,杨,扬,疡,痒,养,样,瑶,摇,尧,遥,窑,谣,药,爷,页,业,叶,医,铱,颐,遗,仪,彝,蚁,艺,亿,忆,义,诣,议,谊,译,异,绎,荫,阴,银,饮,樱,婴,鹰,应,缨,莹,萤,营,荧,蝇,颖,哟,拥,佣,痈,踊,咏,涌,优,忧,邮,铀,犹,游,诱,舆,鱼,渔,娱,与,屿,语,吁,御,狱,誉,预,驭,鸳,渊,辕,园,员,圆,缘,远,愿,约,跃,钥,岳,粤,悦,阅,云,郧,匀,陨,运,蕴,酝,晕,韵,杂,灾,载,攒,暂,赞,赃,脏,凿,枣,灶,责,择,则,泽,贼,赠,扎,札,轧,铡,闸,诈,斋,债,毡,盏,斩,辗,崭,栈,战,绽,张,涨,帐,账,胀,赵,蛰,辙,锗,这,贞,针,侦,诊,镇,阵,挣,睁,狰,帧,郑,证,织,职,执,纸,挚,掷,帜,质,钟,终,种,肿,众,诌,轴,皱,昼,骤,猪,诸,诛,烛,瞩,嘱,贮,铸,筑,驻,专,砖,转,赚,桩,庄,装,妆,壮,状,锥,赘,坠,缀,谆,浊,兹,资,渍,踪,综,总,纵,邹,诅,组,钻,致,钟,么,为,只,凶,准,启,板,里,雳,余,链,泄";

    $t="陽,皚,藹,礙,愛,翺,襖,奧,壩,罷,擺,敗,頒,辦,絆,幫,綁,鎊,謗,剝,飽,寶,報,鮑,輩,貝,鋇,狽,備,憊,繃,筆,畢,斃,閉,邊,編,貶,變,辯,辮,鼈,癟,瀕,濱,賓,擯,餅,撥,缽,鉑,駁,蔔,補,參,蠶,殘,慚,慘,燦,蒼,艙,倉,滄,廁,側,冊,測,層,詫,攙,摻,蟬,饞,讒,纏,鏟,産,闡,顫,場,嘗,長,償,腸,廠,暢,鈔,車,徹,塵,陳,襯,撐,稱,懲,誠,騁,癡,遲,馳,恥,齒,熾,沖,蟲,寵,疇,躊,籌,綢,醜,櫥,廚,鋤,雛,礎,儲,觸,處,傳,瘡,闖,創,錘,純,綽,辭,詞,賜,聰,蔥,囪,從,叢,湊,竄,錯,達,帶,貸,擔,單,鄲,撣,膽,憚,誕,彈,當,擋,黨,蕩,檔,搗,島,禱,導,盜,燈,鄧,敵,滌,遞,締,點,墊,電,澱,釣,調,叠,諜,疊,釘,頂,錠,訂,東,動,棟,凍,鬥,犢,獨,讀,賭,鍍,鍛,斷,緞,兌,隊,對,噸,頓,鈍,奪,鵝,額,訛,惡,餓,兒,爾,餌,貳,發,罰,閥,琺,礬,釩,煩,範,販,飯,訪,紡,飛,廢,費,紛,墳,奮,憤,糞,豐,楓,鋒,風,瘋,馮,縫,諷,鳳,膚,輻,撫,輔,賦,複,負,訃,婦,縛,該,鈣,蓋,幹,趕,稈,贛,岡,剛,鋼,綱,崗,臯,鎬,擱,鴿,閣,鉻,個,給,龔,宮,鞏,貢,鈎,溝,構,購,夠,蠱,顧,剮,關,觀,館,慣,貫,廣,規,矽,歸,龜,閨,軌,詭,櫃,貴,劊,輥,滾,鍋,國,過,駭,韓,漢,閡,鶴,賀,橫,轟,鴻,紅,後,壺,護,滬,戶,嘩,華,畫,劃,話,懷,壞,歡,環,還,緩,換,喚,瘓,煥,渙,黃,謊,揮,輝,毀,賄,穢,會,燴,彙,諱,誨,繪,葷,渾,夥,獲,貨,禍,擊,機,積,饑,譏,雞,績,緝,極,輯,級,擠,幾,薊,劑,濟,計,記,際,繼,紀,夾,莢,頰,賈,鉀,價,駕,殲,監,堅,箋,間,艱,緘,繭,檢,堿,鹼,揀,撿,簡,儉,減,薦,檻,鑒,踐,賤,見,鍵,艦,劍,餞,漸,濺,澗,漿,蔣,槳,獎,講,醬,膠,澆,驕,嬌,攪,鉸,矯,僥,腳,餃,繳,絞,轎,較,稭,階,節,莖,驚,經,頸,靜,鏡,徑,痙,競,淨,糾,廄,舊,駒,舉,據,鋸,懼,劇,鵑,絹,傑,潔,結,誡,屆,緊,錦,僅,謹,進,晉,燼,盡,勁,荊,覺,決,訣,絕,鈞,軍,駿,開,凱,顆,殼,課,墾,懇,摳,庫,褲,誇,塊,儈,寬,礦,曠,況,虧,巋,窺,饋,潰,擴,闊,蠟,臘,萊,來,賴,藍,欄,攔,籃,闌,蘭,瀾,讕,攬,覽,懶,纜,爛,濫,撈,勞,澇,樂,鐳,壘,類,淚,籬,離,裏,鯉,禮,麗,厲,勵,礫,曆,瀝,隸,倆,聯,蓮,連,鐮,憐,漣,簾,斂,臉,鏈,戀,煉,練,糧,涼,兩,輛,諒,療,遼,鐐,獵,臨,鄰,鱗,凜,賃,齡,鈴,淩,靈,嶺,領,餾,劉,龍,聾,嚨,籠,壟,攏,隴,樓,婁,摟,簍,蘆,盧,顱,廬,爐,擄,鹵,虜,魯,賂,祿,錄,陸,驢,呂,鋁,侶,屢,縷,慮,濾,綠,巒,攣,孿,灤,亂,掄,輪,倫,侖,淪,綸,論,蘿,羅,邏,鑼,籮,騾,駱,絡,媽,瑪,碼,螞,馬,罵,嗎,買,麥,賣,邁,脈,瞞,饅,蠻,滿,謾,貓,錨,鉚,貿,麽,黴,沒,鎂,門,悶,們,錳,夢,謎,彌,覓,綿,緬,廟,滅,憫,閩,鳴,銘,謬,謀,畝,鈉,納,難,撓,腦,惱,鬧,餒,膩,攆,撚,釀,鳥,聶,齧,鑷,鎳,檸,獰,甯,擰,濘,鈕,紐,膿,濃,農,瘧,諾,歐,鷗,毆,嘔,漚,盤,龐,國,愛,賠,噴,鵬,騙,飄,頻,貧,蘋,憑,評,潑,頗,撲,鋪,樸,譜,臍,齊,騎,豈,啓,氣,棄,訖,牽,扡,釺,鉛,遷,簽,謙,錢,鉗,潛,淺,譴,塹,槍,嗆,牆,薔,強,搶,鍬,橋,喬,僑,翹,竅,竊,欽,親,輕,氫,傾,頃,請,慶,瓊,窮,趨,區,軀,驅,齲,顴,權,勸,卻,鵲,讓,饒,擾,繞,熱,韌,認,紉,榮,絨,軟,銳,閏,潤,灑,薩,鰓,賽,傘,喪,騷,掃,澀,殺,紗,篩,曬,閃,陝,贍,繕,傷,賞,燒,紹,賒,攝,懾,設,紳,審,嬸,腎,滲,聲,繩,勝,聖,師,獅,濕,詩,屍,時,蝕,實,識,駛,勢,釋,飾,視,試,壽,獸,樞,輸,書,贖,屬,術,樹,豎,數,帥,雙,誰,稅,順,說,碩,爍,絲,飼,聳,慫,頌,訟,誦,擻,蘇,訴,肅,雖,綏,歲,孫,損,筍,縮,瑣,鎖,獺,撻,擡,攤,貪,癱,灘,壇,譚,談,歎,湯,燙,濤,縧,騰,謄,銻,題,體,屜,條,貼,鐵,廳,聽,烴,銅,統,頭,圖,塗,團,頹,蛻,脫,鴕,馱,駝,橢,窪,襪,彎,灣,頑,萬,網,韋,違,圍,爲,濰,維,葦,偉,僞,緯,謂,衛,溫,聞,紋,穩,問,甕,撾,蝸,渦,窩,嗚,鎢,烏,誣,無,蕪,吳,塢,霧,務,誤,錫,犧,襲,習,銑,戲,細,蝦,轄,峽,俠,狹,廈,鍁,鮮,纖,鹹,賢,銜,閑,顯,險,現,獻,縣,餡,羨,憲,線,廂,鑲,鄉,詳,響,項,蕭,銷,曉,嘯,蠍,協,挾,攜,脅,諧,寫,瀉,謝,鋅,釁,興,洶,鏽,繡,虛,噓,須,許,緒,續,軒,懸,選,癬,絢,學,勳,詢,尋,馴,訓,訊,遜,壓,鴉,鴨,啞,亞,訝,閹,煙,鹽,嚴,顔,閻,豔,厭,硯,彥,諺,驗,鴦,楊,揚,瘍,癢,養,樣,瑤,搖,堯,遙,窯,謠,藥,爺,頁,業,葉,醫,銥,頤,遺,儀,彜,蟻,藝,億,憶,義,詣,議,誼,譯,異,繹,蔭,陰,銀,飲,櫻,嬰,鷹,應,纓,瑩,螢,營,熒,蠅,穎,喲,擁,傭,癰,踴,詠,湧,優,憂,郵,鈾,猶,遊,誘,輿,魚,漁,娛,與,嶼,語,籲,禦,獄,譽,預,馭,鴛,淵,轅,園,員,圓,緣,遠,願,約,躍,鑰,嶽,粵,悅,閱,雲,鄖,勻,隕,運,蘊,醞,暈,韻,雜,災,載,攢,暫,贊,贓,髒,鑿,棗,竈,責,擇,則,澤,賊,贈,紮,劄,軋,鍘,閘,詐,齋,債,氈,盞,斬,輾,嶄,棧,戰,綻,張,漲,帳,賬,脹,趙,蟄,轍,鍺,這,貞,針,偵,診,鎮,陣,掙,睜,猙,幀,鄭,證,織,職,執,紙,摯,擲,幟,質,鍾,終,種,腫,衆,謅,軸,皺,晝,驟,豬,諸,誅,燭,矚,囑,貯,鑄,築,駐,專,磚,轉,賺,樁,莊,裝,妝,壯,狀,錐,贅,墜,綴,諄,濁,茲,資,漬,蹤,綜,總,縱,鄒,詛,組,鑽,緻,鐘,麼,為,隻,兇,準,啟,闆,裡,靂,餘,鍊,洩";

    $s=explode(",", $s);
    $t=explode(",", $t);
    $content=str_replace($s, $t, $content);

    return $content;
}
/* 汉字（繁体）康熙笔画 */
function getnum($txt)
{   if ($txt!=""){
$user=M('bihua');
    $map['hanzi']=array('like','%'.$txt.'%');
    $rs = $user->where($map)->select();
if(null !== $rs){
    return $rs[0]['num'];
}
else {
    return 0;
}
}else {
    return "";
}
}
/*根据年龄的称呼  */
function chenghu($nian1){
$userll=date("Y", $nowTime) - $nian1;;
if ($userll<=12) {
    $cf="可爱的";
}elseif ($userll>12 and $userll<=50) {
    $cf="亲爱的";
}elseif ($userll>50) {
    $cf="尊敬的";
}
return $cf;
}
/* 三命通会 */
function smtf($dgz,$tgz){

    $user=M('smtf');
    $rs=$user->where(array('ri'=>$dgz,'shi'=>$tgz))->select();
    if(false!==$rs){
        return $rs;
    }
    else {

        return '';
    }

}

/* 上辈为人 */
function sbwr($num){
    $user=M('sbwr');
    $rs=$user->where(array('num'=>$num))->select();
    if (false!== $rs){
    return $rs;
}
else {
    return '';
}
   }
/* 姓氏起源 */

   function xsqy($xing){
       $user=M('xing');
       $rs=$user->where(array('xing'=>$xing))->select();
       if (false!== $rs){
           return $rs[0]['intro'];
       }
       else {
           return '';
       }

   }

/*  日月时命里*/
function rysmn($yue2,$ri2,$hh2){
    $user=M('rysmn');
    $rs1=$user->where(array('siceng'=>$yue2.'月',))->select();
    $rs2=$user->where(array('siceng'=>$ri2.'日',))->select();
    $rs3=$user->where(array('siceng'=>$hh2.'时',))->select();
    $rs=array($rs1[0]['mingmi'],$rs2[0]['mingmi'],$rs3[0]['mingmi']);
    if(false!==$rs){
        return $rs;
    }
    else {

        return '';
    }

    }

/* 农历时 */
function DiZhi($hh)
{
    $arr = array("子", "丑","丑","寅","寅","卯","卯","辰","辰","巳","巳","午","午","未","未","申","申","酉","酉","戌","戌","亥","亥","子");
    return $arr[$hh];
}
/* 乾造，坤造 */
function bz_sex($xingbie){
    if($xingbie=="男"){
        $bz_sex="乾造";
    }
    else {
        $bz_sex="坤造";
    }
return $bz_sex;
}
/* 通过生日获取属性 */
function sx($y,$m,$d){
    $caltime=$y."-".$m."-".$d.'0'.":".'0'.":"."0";
    $sx=hhcal($caltime);
    $sx = explode('|',$sx);
    return $sx[3];
}
