<?php
header('Content-Type: text/html;charset=utf-8');
include_once dirname(__FILE__).'/bz.php';
/*字符去空格  */
function newtrim($str)
{
    $j=strlen($str);
    $result="";

    for($i=0; $i<$j; $i++) {
        switch($str[$i]) {
            case chr(8):
                # 去掉退格
            case chr(9):
                # 去掉tab
            case chr(10):
                # 去掉换行
            case chr(13):
                # 去掉回车
            case chr(255):
                #去掉特殊空格
                break;
            default:
                $result .= $str[$i];
        }
    }
    return $result;
}
function bz($nian1,$yue1,$ri1,$hh1){
    global $a;
    global $jz;
    global $sczy;
    global $scsy;


    $bzyear=$nian1;
    $bzmonth=$yue1;
    $bzday=$ri1;
    $bztime=$hh1;
    //确定节气 yz 月支  起运基数 qyjs
    $md=$bzmonth * 100 + $bzday;
    if($md>=204 and $md<= 305){
        $mz = 3;
        $qyjs = (($bzmonth - 2) * 30 + $bzday - 4) /3;
    }

    if($md>=306 and $md<=404){
        $mz = 4;

        $qyjs = (($bzmonth - 3) * 30 + $bzday - 6) /3;
    }

    if($md>=405 and $md<= 504){
        $mz = 5;
        $qyjs = (($bzmonth - 4) * 30 + $bzday - 5) /3;
    }

    if($md>=505 and $md<=  605){
        $mz = 6;
        $qyjs = (($bzmonth - 5) * 30 + $bzday - 5) /3;
    }

    if($md>=606 and $md<= 706){
        $mz = 7;
        $qyjs = (($bzmonth - 6) * 30 + $bzday - 6) /3;
    }

    if($md>=707 and $md<= 807){
        $mz = 8;
        $qyjs = (($bzmonth - 7) * 30 + $bzday - 7) /3;
    }

    if($md>=808 and $md<=907){
        $mz = 9;
        $qyjs = (($bzmonth - 8) * 30 + $bzday - 8) /3;
    }

    if($md>=908 and $md<=1007){
        $mz = 10;
        $qyjs = (($bzmonth - 9) * 30 + $bzday - 8) /3;
    }

    if($md>=1008 and $md<= 1106){
        $mz = 11;
        $qyjs = (($bzmonth - 10) * 30 + $bzday - 8) /3;
    }

    if($md>=1107 and $md<=  1207){
        $mz = 0;
        $qyjs = (($bzmonth - 11) * 30 + $bzday - 7) /3;
    }

    if($md>=1208 and $md<=  1231){
        $mz = 1;
        $qyjs = ($bzday - 8) /3;
    }

    if($md>=101 and $md<= 105){
        $mz = 1;
        $qyjs = (30 + $bzday - 4) /3;
    }

    if($md>=106 and $md<=  203){
        $mz = 2;
        $qyjs = (($bzmonth - 1) * 30 + $bzday - 6) /3;
    }
    //确定年干和年支 yg 年干 yz 年支
    if($md>=204 and $md<=1231){
        $yg = ($bzyear - 3) % 10;
        $yz = ($bzyear - 3) % 12;
    }
    if($md>=101 and $md<=203 ){
        $yg = ($bzyear - 4) % 10;
        $yz = ($bzyear - 4) % 12;
    }

    //确定月干 $mg 月干

    If ($mz > 2 And $mz <= 11){

        $mg = ($yg * 2 + $mz + 8) % 10;
    } else {
        $mg = ($yg * 2 + $mz) % 10;
    }
    //从公元0年到目前年份的天数 yearlast

    $yearlast = ($bzyear - 1) * 5 + ($bzyear - 1) / 4 - ($bzyear - 1) / 100 + ($bzyear - 1) / 400;
    //计算某月某日与当年1月0日的时间差（以日为单位）yearday
    $yearday = 0;
    for ($i = 1; $i<$bzmonth; $i++) {
        if(in_array($i, array( 1, 3, 5, 7, 8, 10, 12))) {
            $yearday = $yearday + 31;
        } elseif (in_array($i, array(4, 6, 9, 11))) {
            $yearday = $yearday + 30;
        } else {
            if ($bzyear % 4 == 0 And (($bzyear % 100) <> 0) Or $bzyear % 400 == 0) {
                $yearday = $yearday + 29;
            } else {
                $yearday = $yearday + 28;
            }
        }
    }
    $yearday = $yearday + $bzday;

    //计算日的六十甲子数 day60
    $day60 = ($yearlast + $yearday + 6015) % 60;

    //确定 日干 dg  日支  dz
    $dg = $day60 % 10;
    $dz = $day60 % 12;
    //确定 时干 tg 时支 tz
    $tz = ($bztime + 3) / 2 % 12;
    //'tg = (dg * 2 + tz + 8) % 10
    if ($tz == 0){
        $tg = ($dg * 2 + $tz) % 10;
    } else {
        $tg = ($dg * 2 + $tz + 8) % 10;
    }
    //'把 年月日时 转换成为 生辰八字
    switch($yz) {
        Case 1:
            $yzg = 0;
            break;
        Case 2:
        case 8:
            $yzg = 6;
            break;
        Case 3:
            $yzg = 1;
            break;
        Case 4:
            $yzg = 2;
            break;
        Case 5:
        case 11:
            $yzg = 5;
            break;
        Case 6:
            $yzg = 3;
            break;
        Case 7:
            $yzg = 4;
            break;
        Case 9:
            $yzg = 7;
            break;
        Case 10:
            $yzg = 8;
            break;
        Case 0:
            $yzg = 9;
            break;
    }

    //'月支纳干 $mzg
    switch($mz){
        Case 1:
            $mzg = 0;
            break;
        Case 2:
        case 8:
            $mzg = 6;
            break;
        Case 3:
            $mzg = 1;
            break;
        Case 4:
            $mzg = 2;
            break;
        Case 5:
        case 11:
            $mzg = 5;
            break;
        Case 6:
            $mzg = 3;
            break;
        Case 7:
            $mzg = 4;
            break;
        Case 9:
            $mzg = 7;
            break;
        Case 10:
            $mzg = 8;
            break;
        Case 0:
            $mzg = 9;
            break;
    }

    //'日支纳干 dzg

    switch($dz) {
        case 1:
            $dzg = 0;
            break;
        case 2:
        case 8:
            $dzg = 6;
            break;
        case 3:
            $dzg = 1;
            break;
        case 4:
            $dzg = 2;
            break;
        case 5:
        case 11:
            $dzg = 5;
            break;
        case 6:
            $dzg = 3;
            break;
        case 7:
            $dzg = 4;
            break;
        case 9:
            $dzg = 7;
            break;
        case 10:
            $dzg = 8;
            break;
        case 0:
            $dzg = 9;
    }

    //'时支纳干 tzg
    switch($tz) {
        case 1:
            $tzg = 0;
            break;
        case 2:
        case 8:
            $tzg = 6;
            break;
        case 3:
            $tzg = 1;
            break;
        case 4:
            $tzg = 2;
            break;
        case 5:
        case 11:
            $tzg = 5;
            break;
        case 6:
            $tzg = 3;
            break;
        case 7:
            $tzg = 4;
            break;
        case 9:
            $tzg = 7;
            break;
        case 10:
            $tzg = 8;
            break;
        case 0:
            $tzg = 9;
    }
    //'确定各支对应的十神

    //'年干十神 ygs
    $ygs = (($yg + 11 - $dg) + (($dg + 1) % 2) * (($yg + 10 - $dg) % 2) * 2) % 10;

    //'月干十神 mgs
    $mgs = (($mg + 11 - $dg) + (($dg + 1) % 2) * (($mg + 10 - $dg) % 2) * 2) % 10;

    //'时干十神 $dgs
    $tgs = (($tg + 11 - $dg) + (($dg + 1) % 2) * (($tg + 10 - $dg) % 2) * 2) % 10;

    //'年支十神 yzs
    $yzs = (($yzg + 11 - $dg) + (($dg + 1) % 2) * (($yzg + 10 - $dg) % 2) * 2) % 10;

    //'月支十神 mzs
    $mzs = (($mzg + 11 - $dg) + (($dg + 1) % 2) * (($mzg + 10 - $dg) % 2) * 2) % 10;

    //'日支十神 dzs
    $dzs = (($dzg + 11 - $dg) + (($dg + 1) % 2) * (($dzg + 10 - $dg) % 2) * 2) % 10;

    //'时支十神 tzs
    $tzs = (($tzg + 11 - $dg) + (($dg + 1) % 2) * (($tzg + 10 - $dg) % 2) * 2) % 10;

    //'到此，完成各地支所纳天干的确定任务
    $yg1=$a[20 + $yg];
    $yz1=$a[30 + $yz];
    $mg1=$a[20 + $mg];
    $mz1=$a[30 + $mz];
    $dg1=$a[20 + $dg];
    $dz1=$a[30 + $dz];
    $tg1=$a[20 + $tg];
    $tz1=$a[30 + $tz];
    $ygz=$a[20 + $yg] . $a[30 + $yz];
    $mgz=$a[20 + $mg] . $a[30 + $mz];
    $dgz=$a[20 + $dg] . $a[30 + $dz];
    $tgz=$a[20 + $tg] . $a[30 + $tz];

    /*大运  */
    for ($i=1; $i<=6; $i++) {
        $dayun[]=$a[20+((($mg+10)-$i) % 10)].$a[30+((($mz+12)-$i) % 12)] ;
    }
    /* 命造简批 */
    $sex=get_xingbie();
if ($sex=="男"){
    $sex=1;
}
    else {
        $sex=0;
    }

If ($sex And $dzs == 3) {
    $mzjp[]="<br>". "自己瘦，妻子肥胖" ;
}
    If ($sex == 0 And $dzs == 3){
        $mzjp[]="<br>". "自己肥胖，丈夫瘦" ;
    }

    //'与下海有关的因素: 正偏财克正偏印；官见伤官
    If (($ygs == 5 Or $ygs == 6 Or $mgs == 5 Or $mgs == 6 Or $tgs == 5 Or $tgs == 6) And ($ygs == 9 Or $ygs == 0 Or $mgs == 9 Or $mgs == 0 Or $tgs == 9 Or $tgs == 0)) {
        $mzjp[]="<br>"."经商下海做生意" ;
    }
    If (($ygs == 8 Or $mgs == 8 Or $tgs == 8) And ($ygs == 4 Or $mgs == 4 Or $ygs == 4) ) {
       $mzjp[]="<br>"."经商下海做生意" ;
    }

    //'近视：天干金被火克
    If (($yg == 7 Or $yg == 8 Or $mg == 7 Or $mg == 8 Or $tg == 7 Or $tg == 8) And ($yg == 3 Or $yg == 4 Or $mg == 3 Or $mg == 4 Or $tg == 3 Or $tg == 4)) {
       $mzjp[]="<br>" . "要注意预防眼睛方面的疾病，容易近视";
    }
    //'和算命、神秘有关的因素:日支或年支为戌，他支有亥；日支或年支为亥，他支有戌
    If (($yz == 11 Or $dz == 11) And ($yz == 0 Or $mz == 0 Or $dz == 0 Or $tz == 0)) {
         $mzjp[]="<br>"."近神学之人";
    }elseIf (($yz == 0 Or $dz == 0) And ($yz == 11 Or $mz == 11 Or $dz == 11 Or $tz == 11)) {
         $mzjp[]="<br>" . "近神学之人";
    }

    //'/*事业解说*/
    switch($tgs) {
        case 1:
            $mzjp[]="<br>" . "在事业方面，可以受到兄弟的帮助。" ;
            break;
        case 2:
            $mzjp[]="<br>" . "在事业方面，可以受到姊妹的帮助" ;
            break;
        case 3:
        case 4:
            $mzjp[]="<br>" . "在事业方面，可以从事思考方面的职业" ;
            break;
        case 5:
           $mzjp[]="<br>" . "在事业方面，可以受到父亲的帮助。" ;
            break;
        case 6:
            $mzjp[]="<br>" . "在事业方面，可以受到配偶或与配偶同辈的帮助。" ;
            break;
        case 7:
        case 8:
            $mzjp[]="<br>" . "在事业方面，可以受到师长、上司的帮助" ;
            break;
        case 9:
             $mzjp[]="<br>" . "在事业方面，可以受到母亲辈的帮助。" ;
            break;
        case 0:
             $mzjp[]="<br>" . "在事业方面，可以受到长辈贵人的帮助。" ;
            break;
    }

    //'/*婚姻解说--男*/
    If ($sex) {
        switch($dzs) {

            case 1:
                 $mzjp[]="<br>" . "婚姻易变，多波折。";
                break;
            case 2:
                $mzjp[]="<br>" . "會较为晚婚，婚姻多波折。";
                break;
            case 3:
                $mzjp[]="<br>" . "妻贤慧能持家，得衣食财帛，妻肥胖。";
                break;
            case 4:
                $mzjp[]="<br>" . "妻子美貌，但志高无才能。";
                break;
            case 5:
               $mzjp[]="<br>" . "妾夺妻权，但有善待丈夫。不爱妻反爱妾。";
                break;
            case 6:
                $mzjp[]="<br>" . "得妻扶助成功，白手成家自然富贵。";
                break;
            case 7:
                If (($ygs <> 3) Or ($mgs <> 3) Or ($tgs <> 3)) {
                   $mzjp[]="<br>" . "须多注意身体。";
                }
                break;
            case 8:
                $mzjp[]="<br>" . "独立持家，地位安定，又得妻力，或与名门之女结婚";
                $mzjp[]="<br>" . "妻妾相貌敦厚，贤淑温顺。";
                break;
            case 9:
                $mzjp[]="<br>" . "妻做事敏捷迅速.";
                break;
            case 0:
               $mzjp[]="<br>" . "妻子贤淑，能得内助之力而成功。";
        }
    }
    switch($dz % 4) {

        case 1:
            If (($yz == 10) Or ($mz == 10)) {
                $mzjp[]="<br>" . $a[11] ;
            }
            If ($tz == 10) {
             $mzjp[]="<br>" . $a[12];
            }
            break;
        case 2:
            If (($yz == 7) Or ($mz == 7)) {
               $mzjp[]="<br>" . $a[11];
            }
            If ($tz == 7) {
               $mzjp[]="<br>" . $a[12];
            }
            break;
        case 3:
            If (($yz == 4) Or ($mz == 4)) {
               $mzjp[]="<br>" . $a[11];
            }
            If ($tz == 4) {
               $mzjp[]="<br>" . $a[12] ;
            }
            break;
        case 0:
            If (($yz == 1) Or ($mz == 1)) {
              $mzjp[]="<br>" . $a[11];
            }
            If ($tz == 1) {
               $mzjp[]="<br>" . $a[12];
            }
            break;
    }
    //'/*桃花*/

    switch($dz % 3) {
        case 1:
            $mzjp[]="<br>" . $a[182];
            //'/*将星*/;
            break;
        case 2:
             $mzjp[]="<br>" . $a[183];
            //'/*华盖*/;
            break;
        case 0:
             $mzjp[]="<br>" . $a[184];
            break;
            //'/*驿马*/
    }

    switch($dg) {
        case 1:
        case 5:
        case 7:

            If (($yz == 2) Or ($yz == 8) Or ($mz == 2) Or ($mz == 8) Or ($tz == 2) Or ($tz == 8)) {
                 $mzjp[]="<br>" . $a[13];
            }

            break;
        case 2:
        case 6:
            If (($yz == 1) Or ($yz == 9) Or ($mz == 1) Or ($mz == 9) Or ($tz == 1) Or ($tz == 9)) {
                  $mzjp[]="<br>" . $a[13];
            }

            break;
        case 3:
        case 4:
            If (($yz == 10) Or ($yz == 12) Or ($mz == 12) Or ($mz == 10) Or ($tz == 12) Or ($tz == 10) Or ($dz == 12) Or ($dz == 10)) {
                  $mzjp[]="<br>" .$a[13];
            }
            break;
        case 9:
        case 0:
            If (($yz == 4) Or ($yz == 6) Or ($mz == 4) Or ($mz == 6) Or ($tz == 4) Or ($tz == 6) Or ($dz == 4) Or ($dz == 6)) {
                 $mzjp[]="<br>" . $a[13];
            }
            break;
        case 8:
            If (($yz == 3) Or ($yz == 7) Or ($mz == 3) Or ($mz == 7) Or ($tz == 3) Or ($tz == 7) Or ($dz == 3) Or ($dz == 7)) {
                  $mzjp[]="<br>" . $a[13];
            }
            break;
    }


    //'/*天乙*/

    switch($mz){
        case 4:
            If ($day60 == 21) {
                 $mzjp[]="<br>" . $a[14];
            }
            break;
        case 9:
            If ($day60 == 59) {
              $mzjp[]="<br>" . $a[14];
            }
            break;
        case 10:
            If ($day60 == 27) {
                $mzjp[]="<br>" . $a[14];
            }
            break;
        case 1:
            If ($day60 == 9) {
                $mzjp[]="<br>" . $a[14];
            }
            break;
        case 7:
            If ($day60 == 3) {
               $mzjp[]="<br>" . $a[14];
            }
            break;
    }
    //'/*天月二德*/

    if(in_array($day60,array(1, 2, 12, 3, 13, 24, 34, 45, 56, 7, 18, 29, 50))) {
       $mzjp[]="<br>" . "不愁吃穿,衣食丰足." ;
    }
    //'/*天福贵人*/


    switch($dg) {
        case 1:
            If ((($mz == 12) Or ($mz == 0)) And (($tz == 12) Or ($tz == 0))) {
               $mzjp[]="<br>" . $a[18];
            }
            break;
        case 2:
            If (($mz == 7) And ($tz == 7)) {
                $mzjp[]="<br>" . $a[18];
            }
            break;
        case 3:
        case 5:
            If (($mz == 3) And ($tz == 3)) {
               $mzjp[]="<br>" . $a[18];
            }
            break;
        case 4:
        case 6:
            If (($mz == 10) And ($tz == 10)) {
               $mzjp[]="<br>" . $a[18];
            }
            break;
        case 7:
            If (($mz == 6) And ($tz == 6)) {
                $mzjp[]="<br>" . $a[18];
            }
            break;
        case 8:
            If (($mz == 1) And ($tz == 1)) {
               $mzjp[]="<br>" . $a[18];
            }
            break;
        case 9:
            If (($mz == 9) And ($tz == 9)) {
               $mzjp[]="<br>" . $a[18];
            }
            break;
        case 0:
            If (($mz == 4) And ($tz == 4)) {
              $mzjp[]="<br>" . $a[18];
            }

    }
    //'/*学堂*/


    switch($mz){
        case 3:
        case 4:
        case 5:

            If ($day60 == 15) {
               $mzjp[]="<br>" . $a[19];
            }
            break;
        case 6:
        case 7:
        case 8:
            If ($day60 == 31) {
                $mzjp[]="<br>" . $a[19];
            }
            break;
        case 9:
        case 10:
        case 11:
            If ($day60 == 45) {
               $mzjp[]="<br>"  . $a[19];
            }
            break;
        case 0:
        case 1:
        case 2:

            If ($day60 == 1) {
              $mzjp[]="<br>" . $a[19];
            }
            break;
    }


    //'/*天赫吉星*/

    If (($ygs == 8) Or ($yzs == 8)) {
        $mzjp[]="<br>" . $a[51];
    }

    //'/*年正官*/


    If (($mgs == 8) Or ($mzs == 8)) {
        $mzjp[]="<br>" . $a[52];
    }

    //'/*月正官*/

    If (($tgs == 8) Or ($tzs == 8)) {
         $mzjp[]="<br>" . $a[55];
    }

    //'/*时正官*/

    If (($ygs == 1) Or ($yzs == 1)) {
        $mzjp[]="<br>" . $a[53];
    }

    //' /*年比肩*/

    If (($mgs == 1) Or ($mzs == 1)) {
       $mzjp[]="<br>" . $a[54];
    }

    //'/*月比肩*/

    If (($tgs == 1) Or ($tzs == 1)) {
       $mzjp[]="<br>" . $a[56];
    }

    //'/*时比肩*/

    If (($ygs == 2) Or ($yzs == 2)) {
         $mzjp[]="<br>" . $a[57];
    }

    //'/*年劫财*/

    If (($mgs == 2) Or ($mzs == 2)) {
         $mzjp[]="<br>" . $a[58];
    }
    //'/*月劫财*/

    If (($tgs == 2) Or ($tzs == 2)) {
         $mzjp[]="<br>" . $a[59];
    }
    //'/*时劫财*/

    If (($ygs == 3) Or ($yzs == 3)) {
         $mzjp[]="<br>" . $a[60];
    }
    //'/*年食神*/

    If (($mgs == 3) Or ($mzs == 3)) {
         $mzjp[]="<br>" . $a[61];
    }
    //' /*月食神*/

    If ($sex == 1 And (($tgs == 3) Or ($tzs == 3))) {
        $mzjp[]="<br>" . $a[62];
    }
    //'/*时食神*/

    If (($ygs == 4) Or ($yzs == 4)) {
        $mzjp[]="<br>" . $a[63];
    }
    //'/*年伤官*/

    If (($mgs == 4) Or ($mzs == 4)) {
         $mzjp[]="<br>" . $a[64];
    }
    //'/*月伤官*/

    If (($tgs == 4) Or ($tzs == 4)) {
         $mzjp[]="<br>" . $a[65];
    }
    //' /*时伤官*/

    If (($ygs == 5) Or ($yzs == 5)) {
        $mzjp[]="<br>" . $a[66];
    }
    //'/*年偏财*/

    If (($mgs == 5) Or ($mzs == 5)) {
        $mzjp[]="<br>" . $a[67];
    }
    //'/*月偏财*/

    If (($ygs == 6) Or ($yzs == 6)) {
       $mzjp[]="<br>" . $a[68];
    }

    //'/*年正财*/

    If (($mgs == 6) Or ($mzs == 6)) {
         $mzjp[]="<br>" . $a[69];
    }
    //'/*月正财*/

    If (($tgs == 6) Or ($tzs == 6)) {
        $mzjp[]= "<br>" . $a[70];
    }
    //'/*时正财*/

    If (($tgs == 7) Or ($tzs == 7)) {
        $mzjp[]="<br>" . $a[71];
    }

    //'/*时七杀*/

    If (($ygs == 9) Or ($yzs == 9)) {
         $mzjp[]="<br>" . $a[72];
    }

    //'/*年偏印*/

    If (($mgs == 9) Or ($mzs == 9)) {
        $mzjp[]="<br>" . $a[73];
    }

    //'/*月偏印*/

    If (($tgs == 9) Or ($tzs == 9)) {
        $mzjp[]="<br>" . $a[74];
    }

    //'/*时偏印*/

    If (($ygs == 0) Or ($yzs == 0)) {
        $mzjp[]="<br>" . $a[75];
    }
    //' /*年正印*/

    If (($mgs == 0) Or ($mzs == 0)) {
        $mzjp[]="<br>" . $a[76];
    }
    //' /*月正印*/

    If (($tgs == 0) Or ($tzs == 0)) {
        $mzjp[]="<br>" . $a[77];
    }
    //'/*时正印*/


    If ($sex == 1) {

        If (($tgs == 4) And (($mgs == 5) Or ($mgs == 6) Or ($tgs == 5) Or ($tgs == 6))) {


            $mzjp[]="<br>" . $a[245];
        }

        //'/*4+5(6)*/
        If (($tgs == 4) And (($mgs == 7) Or ($ygs == 7))) {

            $mzjp[]="<br>" . $a[247];
        }

        //'/*4+7*/
        If (($tgs == 4) And (($mgs == 9) Or ($ygs == 9))) {


            $mzjp[]="<br>" . $a[249];
        }

        //'/*4+9*/
        If (($tgs == 4) And (($mgs == 0) Or ($ygs == 0))) {

            $mzjp[]="<br>" . $a[240];
        }
        //'/*4+0*/
        If ((($tgs == 5) Or ($tgs == 6)) And (($mgs == 9) Or ($ygs == 9))) {

            $mzjp[]="<br>" . $a[259];
        }
        //'/*5(6)+9*/
        If ((($tgs == 5) Or ($tgs == 6)) And (($mgs == 7) Or ($ygs == 7))) {

            $mzjp[]="<br>" . $a[257];
        }

        //'/*5(6)+7*/
        If ((($tgs == 5) Or ($tgs == 6)) And (($mgs == 8) Or ($ygs == 8))) {

            $mzjp[]="<br>" . $a[258];
        }
        //'/*5(6)+8*/
        If ((($tgs == 5) Or ($tgs == 6)) And (($mgs == 4) Or ($ygs == 4))) {

            $mzjp[]="<br>" . $a[245];
        }

        //'/*5(6)+4*/
        If (($tgs == 3) And (($mgs == 7) Or ($ygs == 7))) {

            $mzjp[]="<br>" . $a[237];
        }
        //'/*3+7*/
        If (($tgs == 3) And (($mgs == 0) Or ($ygs == 0))) {

            $mzjp[]="<br>" . $a[230];
        }
        //'/*3+0*/
        If (($tgs == 3) And (($mgs == 5) Or ($ygs == 5) Or ($mgs == 6) Or ($ygs == 6))) {

            $mzjp[]="<br>" . $a[235];
        }
        //'/*3+5(6)*/
        If (($tgs == 3) And (($mgs == 8) Or ($ygs == 8))) {

            $mzjp[]="<br>" . $a[238];
        }
        //'/*3+8*/
        If (($tgs == 7) And (($mgs == 3) Or ($ygs == 3))) {

            $mzjp[]="<br>" . $a[237];
        }
        //'/*7+3*/
        If (($tgs == 7) And (($mgs == 4) Or ($ygs == 4))) {

            $mzjp[]="<br>" . $a[247];
        }
        //'/*7+4*/
        If (($tgs == 7) And (($mgs == 5) Or ($ygs == 5) Or ($mgs == 6) Or ($ygs == 6))) {

            $mzjp[]="<br>" . $a[257];
        }
        //'/*7+5(6)*/
        If (($tgs == 7) And (($mgs == 0) Or ($ygs == 0))) {

            $mzjp[]="<br>" . $a[270];
        }
        //'/*7+0*/
        If (($tgs == 8) And (($mgs == 0) Or ($ygs == 0))) {

            $mzjp[]="<br>" . $a[280];
        }
        //'/*8+0*/
        If (($tgs == 8) And (($mgs == 3) Or ($ygs == 3))) {

            $mzjp[]="<br>" . $a[238];
        }
        //'/*8+3*/
        If (($tgs == 8) And (($mgs == 5) Or ($ygs == 5) Or ($mgs == 6) Or ($ygs == 6))) {

            $mzjp[]="<br>" . $a[258];
        }
        //'/*8+5(6)*/
        If (($tgs == 9) And (($mgs == 5) Or ($ygs == 5) Or ($mgs == 6) Or ($ygs == 6))) {

            $mzjp[]="<br>" . $a[259];
        }
        //'/*9+5(6)*/
        If (($tgs == 9) And (($mgs == 4) Or ($ygs == 4))) {

            $mzjp[]="<br>" . $a[249];
        }
        //'/*9+4*/
        If (($tgs == 0) And (($mgs == 4) Or ($ygs == 4))) {

            $mzjp[]="<br>" . $a[240];
        }
        //'/*0+4*/
        If (($tgs == 0) And (($mgs == 3) Or ($ygs == 3))) {

            $mzjp[]="<br>" . $a[230];
        }

        //' /*0+3*/
        If (($tgs == 0) And (($mgs == 7) Or ($ygs == 7))) {

            $mzjp[]="<br>" . $a[270];
        }
        //'/*0+7*/
        If (($tgs == 0) And (($mgs == 8) Or ($ygs == 8))) {

            $mzjp[]="<br>" . $a[280];
        }
        //'单独从年月日时的一些论断方法
        //'单独从生日论命
        //'原来是用来论年，现在用来论日（60甲子）
      $mzjp[]="<br>" .$jz[(60 + 6 * $dg - 5 * $dz) % 60];
        //'单独从时辰论命

        If ($tz == 0 Or $tz == 12) {
            $scdz = 12;
        }
        Else{
            $scdz = $tz;
        }

       $mzjp[]="<br>". $scsy[$scdz] . $sczy[$scdz];

    $bz = array (
            yg => $yg1,//年干
            yz => $yz1,//年支
            mg => $mg1,//月干
            mz => $mz1,//月支
            dg => $dg1,//日干
            dz => $dz1,//日支
            tg => $tg1,//时干
            tz => $tz1,//时支
            ygz=> $ygz,//年干支
            mgz=> $mgz,//月干支
            dgz=> $dgz,//日干支
            tgz=> $tgz,//时干支
            ygs=>$ygs,//年干十神
            yzs=>$yzs,//年支十神
            mgs=>$mgs,//月干十神
            mzs=>$mzs,//月支十神
            dzs=>$dzs,//日支十神
            tgs=>$tgs,//时干十神
            tzd=>$tzs,//时支十神
            qyjs=>$qyjs,//起运基数
            dayun=>$dayun,//大运
            mzjp=>$mzjp,//命运简批
    );
    return $bz;

}
}
/* 通过天干地支计算五行 */
 function tgdzwh($tgdz)
{
    $arr = array("子" => "水"
            ,"亥" => "水"
            ,"寅" => "木"
            ,"卯" => "木"
            ,"巳" => "火"
            ,"午" => "火"
            ,"申" => "金"
            ,"酉" => "金"
            ,"辰" => "土"
            ,"戌" => "土"
            ,"丑" => "土"
            ,"未" => "土"
            ,"甲" => "木"
            ,"乙" => "木"
            ,"丙" => "火"
            ,"丁" => "火"
            ,"戊" => "土"
            ,"己" => "土"
            ,"庚" => "金"
            ,"辛" => "金"
            ,"壬" => "水"
            ,"癸" => "水"
    );
    return $arr[$tgdz];
}
/*通过月份计算冬天  */
function siji($yue)
{
    $arr = array ("1" => "冬"
            ,"2" => "冬"
            ,"3" => "春"
            ,"4" => "春"
            ,"5" => "春"
            ,"6" => "夏"
            ,"7" => "夏"
            ,"8" => "夏"
            ,"9" => "秋"
            ,"10" => "秋"
            ,"11" => "秋"
            ,"12" => "冬");
    return $arr[$yue];
}
/* 性格分析 */
function xgfx($yue1,$ri1){
    global $west;
    $xgfx=$west[$ri1] . "<br>" . $west[100 * $yue1 + $ri1] . "<br>";
    return $xgfx;

}

/* 三才 */
function getsancai($sc)
{
    $sc=$sc%10;
    switch($sc){
        case 1:
        case 2:
            $sctxt="木";
            break;
        case 3:
        case 4:
            $sctxt="火";
            break;
        case 5:
        case 6:
            $sctxt="土";
            break;
        case 7:
        case 8:
            $sctxt="金";
            break;
        case 9:
        case 10:
        case 0:
            $sctxt="水";
            break;
    }

    return $sctxt;

}
/*字转拼音  */
function pin($num)
{
    static $d = array(
        "a" => -20319
        ,"ai" => -20317
        ,"an" => -20304
        ,"ang" => -20295
        ,"ao" => -20292
        ,"ba" => -20283
        ,"bai" => -20265
        ,"ban" => -20257
        ,"bang" => -20242
        ,"bao" => -20230
        ,"bei" => -20051
        ,"ben" => -20036
        ,"beng" => -20032
        ,"bi" => -20026
        ,"bian" => -20002
        ,"biao" => -19990
        ,"bie" => -19986
        ,"bin" => -19982
        ,"bing" => -19976
        ,"bo" => -19805
        ,"bu" => -19784
        ,"ca" => -19775
        ,"cai" => -19774
        ,"can" => -19763
        ,"cang" => -19756
        ,"cao" => -19751
        ,"ce" => -19746
        ,"ceng" => -19741
        ,"cha" => -19739
        ,"chai" => -19728
        ,"chan" => -19725
        ,"chang" => -19715
        ,"chao" => -19540
        ,"che" => -19531
        ,"chen" => -19525
        ,"cheng" => -19515
        ,"chi" => -19500
        ,"chong" => -19484
        ,"chou" => -19479
        ,"chu" => -19467
        ,"chuai" => -19289
        ,"chuan" => -19288
        ,"chuang" => -19281
        ,"chui" => -19275
        ,"chun" => -19270
        ,"chuo" => -19263
        ,"ci" => -19261
        ,"cong" => -19249
        ,"cou" => -19243
        ,"cu" => -19242
        ,"cuan" => -19238
        ,"cui" => -19235
        ,"cun" => -19227
        ,"cuo" => -19224
        ,"da" => -19218
        ,"dai" => -19212
        ,"dan" => -19038
        ,"dang" => -19023
        ,"dao" => -19018
        ,"de" => -19006
        ,"deng" => -19003
        ,"di" => -18996
        ,"dian" => -18977
        ,"diao" => -18961
        ,"die" => -18952
        ,"ding" => -18783
        ,"diu" => -18774
        ,"dong" => -18773
        ,"dou" => -18763
        ,"du" => -18756
        ,"duan" => -18741
        ,"dui" => -18735
        ,"dun" => -18731
        ,"duo" => -18722
        ,"e" => -18710
        ,"en" => -18697
        ,"er" => -18696
        ,"fa" => -18526
        ,"fan" => -18518
        ,"fang" => -18501
        ,"fei" => -18490
        ,"fen" => -18478
        ,"feng" => -18463
        ,"fo" => -18448
        ,"fou" => -18447
        ,"fu" => -18446
        ,"ga" => -18239
        ,"gai" => -18237
        ,"gan" => -18231
        ,"gang" => -18220
        ,"gao" => -18211
        ,"ge" => -18201
        ,"gei" => -18184
        ,"gen" => -18183
        ,"geng" => -18181
        ,"gong" => -18012
        ,"gou" => -17997
        ,"gu" => -17988
        ,"gua" => -17970
        ,"guai" => -17964
        ,"guan" => -17961
        ,"guang" => -17950
        ,"gui" => -17947
        ,"gun" => -17931
        ,"guo" => -17928
        ,"ha" => -17922
        ,"hai" => -17759
        ,"han" => -17752
        ,"hang" => -17733
        ,"hao" => -17730
        ,"he" => -17721
        ,"hei" => -17703
        ,"hen" => -17701
        ,"heng" => -17697
        ,"hong" => -17692
        ,"hou" => -17683
        ,"hu" => -17676
        ,"hua" => -17496
        ,"huai" => -17487
        ,"huan" => -17482
        ,"huang" => -17468
        ,"hui" => -17454
        ,"hun" => -17433
        ,"huo" => -17427
        ,"ji" => -17417
        ,"jia" => -17202
        ,"jian" => -17185
        ,"jiang" => -16983
        ,"jiao" => -16970
        ,"jie" => -16942
        ,"jin" => -16915
        ,"jing" => -16733
        ,"jiong" => -16708
        ,"jiu" => -16706
        ,"ju" => -16689
        ,"juan" => -16664
        ,"jue" => -16657
        ,"jun" => -16647
        ,"ka" => -16474
        ,"kai" => -16470
        ,"kan" => -16465
        ,"kang" => -16459
        ,"kao" => -16452
        ,"ke" => -16448
        ,"ken" => -16433
        ,"keng" => -16429
        ,"kong" => -16427
        ,"kou" => -16423
        ,"ku" => -16419
        ,"kua" => -16412
        ,"kuai" => -16407
        ,"kuan" => -16403
        ,"kuang" => -16401
        ,"kui" => -16393
        ,"kun" => -16220
        ,"kuo" => -16216
        ,"la" => -16212
        ,"lai" => -16205
        ,"lan" => -16202
        ,"lang" => -16187
        ,"lao" => -16180
        ,"le" => -16171
        ,"lei" => -16169
        ,"leng" => -16158
        ,"li" => -16155
        ,"lia" => -15959
        ,"lian" => -15958
        ,"liang" => -15944
        ,"liao" => -15933
        ,"lie" => -15920
        ,"lin" => -15915
        ,"ling" => -15903
        ,"liu" => -15889
        ,"long" => -15878
        ,"lou" => -15707
        ,"lu" => -15701
        ,"lv" => -15681
        ,"luan" => -15667
        ,"lue" => -15661
        ,"lun" => -15659
        ,"luo" => -15652
        ,"ma" => -15640
        ,"mai" => -15631
        ,"man" => -15625
        ,"mang" => -15454
        ,"mao" => -15448
        ,"me" => -15436
        ,"mei" => -15435
        ,"men" => -15419
        ,"meng" => -15416
        ,"mi" => -15408
        ,"mian" => -15394
        ,"miao" => -15385
        ,"mie" => -15377
        ,"min" => -15375
        ,"ming" => -15369
        ,"miu" => -15363
        ,"mo" => -15362
        ,"mou" => -15183
        ,"mu" => -15180
        ,"na" => -15165
        ,"nai" => -15158
        ,"nan" => -15153
        ,"nang" => -15150
        ,"nao" => -15149
        ,"ne" => -15144
        ,"nei" => -15143
        ,"nen" => -15141
        ,"neng" => -15140
        ,"ni" => -15139
        ,"nian" => -15128
        ,"niang" => -15121
        ,"niao" => -15119
        ,"nie" => -15117
        ,"nin" => -15110
        ,"ning" => -15109
        ,"niu" => -14941
        ,"nong" => -14937
        ,"nu" => -14933
        ,"nv" => -14930
        ,"nuan" => -14929
        ,"nue" => -14928
        ,"nuo" => -14926
        ,"o" => -14922
        ,"ou" => -14921
        ,"pa" => -14914
        ,"pai" => -14908
        ,"pan" => -14902
        ,"pang" => -14894
        ,"pao" => -14889
        ,"pei" => -14882
        ,"pen" => -14873
        ,"peng" => -14871
        ,"pi" => -14857
        ,"pian" => -14678
        ,"piao" => -14674
        ,"pie" => -14670
        ,"pin" => -14668
        ,"ping" => -14663
        ,"po" => -14654
        ,"pu" => -14645
        ,"qi" => -14630
        ,"qia" => -14594
        ,"qian" => -14429
        ,"qiang" => -14407
        ,"qiao" => -14399
        ,"qie" => -14384
        ,"qin" => -14379
        ,"qing" => -14368
        ,"qiong" => -14355
        ,"qiu" => -14353
        ,"qu" => -14345
        ,"quan" => -14170
        ,"que" => -14159
        ,"qun" => -14151
        ,"ran" => -14149
        ,"rang" => -14145
        ,"rao" => -14140
        ,"re" => -14137
        ,"ren" => -14135
        ,"reng" => -14125
        ,"ri" => -14123
        ,"rong" => -14122
        ,"rou" => -14112
        ,"ru" => -14109
        ,"ruan" => -14099
        ,"rui" => -14097
        ,"run" => -14094
        ,"ruo" => -14092
        ,"sa" => -14090
        ,"sai" => -14087
        ,"san" => -14083
        ,"sang" => -13917
        ,"sao" => -13914
        ,"se" => -13910
        ,"sen" => -13907
        ,"seng" => -13906
        ,"sha" => -13905
        ,"shai" => -13896
        ,"shan" => -13894
        ,"shang" => -13878
        ,"shao" => -13870
        ,"she" => -13859
        ,"shen" => -13847
        ,"sheng" => -13831
        ,"shi" => -13658
        ,"shou" => -13611
        ,"shu" => -13601
        ,"shua" => -13406
        ,"shuai" => -13404
        ,"shuan" => -13400
        ,"shuang" => -13398
        ,"shui" => -13395
        ,"shun" => -13391
        ,"shuo" => -13387
        ,"si" => -13383
        ,"song" => -13367
        ,"sou" => -13359
        ,"su" => -13356
        ,"suan" => -13343
        ,"sui" => -13340
        ,"sun" => -13329
        ,"suo" => -13326
        ,"ta" => -13318
        ,"tai" => -13147
        ,"tan" => -13138
        ,"tang" => -13120
        ,"tao" => -13107
        ,"te" => -13096
        ,"teng" => -13095
        ,"ti" => -13091
        ,"tian" => -13076
        ,"tiao" => -13068
        ,"tie" => -13063
        ,"ting" => -13060
        ,"tong" => -12888
        ,"tou" => -12875
        ,"tu" => -12871
        ,"tuan" => -12860
        ,"tui" => -12858
        ,"tun" => -12852
        ,"tuo" => -12849
        ,"wa" => -12838
        ,"wai" => -12831
        ,"wan" => -12829
        ,"wang" => -12812
        ,"wei" => -12802
        ,"wen" => -12607
        ,"weng" => -12597
        ,"wo" => -12594
        ,"wu" => -12585
        ,"xi" => -12556
        ,"xia" => -12359
        ,"xian" => -12346
        ,"xiang" => -12320
        ,"xiao" => -12300
        ,"xie" => -12120
        ,"xin" => -12099
        ,"xing" => -12089
        ,"xiong" => -12074
        ,"xiu" => -12067
        ,"xu" => -12058
        ,"xuan" => -12039
        ,"xue" => -11867
        ,"xun" => -11861
        ,"ya" => -11847
        ,"yan" => -11831
        ,"yang" => -11798
        ,"yao" => -11781
        ,"ye" => -11604
        ,"yi" => -11589
        ,"yin" => -11536
        ,"ying" => -11358
        ,"yo" => -11340
        ,"yong" => -11339
        ,"you" => -11324
        ,"yu" => -11303
        ,"yuan" => -11097
        ,"yue" => -11077
        ,"yun" => -11067
        ,"za" => -11055
        ,"zai" => -11052
        ,"zan" => -11045
        ,"zang" => -11041
        ,"zao" => -11038
        ,"ze" => -11024
        ,"zei" => -11020
        ,"zen" => -11019
        ,"zeng" => -11018
        ,"zha" => -11014
        ,"zhai" => -10838
        ,"zhan" => -10832
        ,"zhang" => -10815
        ,"zhao" => -10800
        ,"zhe" => -10790
        ,"zhen" => -10780
        ,"zheng" => -10764
        ,"zhi" => -10587
        ,"zhong" => -10544
        ,"zhou" => -10533
        ,"zhu" => -10519
        ,"zhua" => -10331
        ,"zhuai" => -10329
        ,"zhuan" => -10328
        ,"zhuang" => -10322
        ,"zhui" => -10315
        ,"zhun" => -10309
        ,"zhuo" => -10307
        ,"zi" => -10296
        ,"zong" => -10281
        ,"zou" => -10274
        ,"zu" => -10270
        ,"zuan" => -10262
        ,"zui" => -10260
        ,"zun" => -10256
        ,"zuo" => -10254 );

    $aa = array_values($d);
    $b = array_keys($d);

    if($num>0 && $num<160) {
        return chr($num);
    }
    if($num<-20319 || $num>-10247){
        return '';
    }
    $k=count($aa);
    while($k--){
        if($aa[$k]<=$num){
            break;
        }
    }
    return $b[$k];
}
 function pinyin($str)
{   $str=mb_convert_encoding($str, "GBK", "UTF-8");
    $c="" ;
    $strLen = strlen($str);
    for($k=0; $k<$strLen; $k++){
        $charCode = ord(substr($str, $k, 1));
        if($charCode>=0x80 && $charCode<=0xFF) {
            $charLowCode = ord(mb_substr($str, ++$k, 1));
            $charCode = $charCode*256 + $charLowCode - 65536;

        }
        $c .= pin($charCode);
/* error */
    }
    return $c;

}
/* 简体转换繁体 */
function GbToBig($content)
{
    $s="阳,皑,蔼,碍,爱,翱,袄,奥,坝,罢,摆,败,颁,办,绊,帮,绑,镑,谤,剥,饱,宝,报,鲍,辈,贝,钡,狈,备,惫,绷,笔,毕,毙,闭,边,编,贬,变,辩,辫,鳖,瘪,濒,滨,宾,摈,饼,拨,钵,铂,驳,卜,补,参,蚕,残,惭,惨,灿,苍,舱,仓,沧,厕,侧,册,测,层,诧,搀,掺,蝉,馋,谗,缠,铲,产,阐,颤,场,尝,长,偿,肠,厂,畅,钞,车,彻,尘,陈,衬,撑,称,惩,诚,骋,痴,迟,驰,耻,齿,炽,冲,虫,宠,畴,踌,筹,绸,丑,橱,厨,锄,雏,础,储,触,处,传,疮,闯,创,锤,纯,绰,辞,词,赐,聪,葱,囱,从,丛,凑,窜,错,达,带,贷,担,单,郸,掸,胆,惮,诞,弹,当,挡,党,荡,档,捣,岛,祷,导,盗,灯,邓,敌,涤,递,缔,点,垫,电,淀,钓,调,迭,谍,叠,钉,顶,锭,订,东,动,栋,冻,斗,犊,独,读,赌,镀,锻,断,缎,兑,队,对,吨,顿,钝,夺,鹅,额,讹,恶,饿,儿,尔,饵,贰,发,罚,阀,珐,矾,钒,烦,范,贩,饭,访,纺,飞,废,费,纷,坟,奋,愤,粪,丰,枫,锋,风,疯,冯,缝,讽,凤,肤,辐,抚,辅,赋,复,负,讣,妇,缚,该,钙,盖,干,赶,秆,赣,冈,刚,钢,纲,岗,皋,镐,搁,鸽,阁,铬,个,给,龚,宫,巩,贡,钩,沟,构,购,够,蛊,顾,剐,关,观,馆,惯,贯,广,规,硅,归,龟,闺,轨,诡,柜,贵,刽,辊,滚,锅,国,过,骇,韩,汉,阂,鹤,贺,横,轰,鸿,红,后,壶,护,沪,户,哗,华,画,划,话,怀,坏,欢,环,还,缓,换,唤,痪,焕,涣,黄,谎,挥,辉,毁,贿,秽,会,烩,汇,讳,诲,绘,荤,浑,伙,获,货,祸,击,机,积,饥,讥,鸡,绩,缉,极,辑,级,挤,几,蓟,剂,济,计,记,际,继,纪,夹,荚,颊,贾,钾,价,驾,歼,监,坚,笺,间,艰,缄,茧,检,碱,硷,拣,捡,简,俭,减,荐,槛,鉴,践,贱,见,键,舰,剑,饯,渐,溅,涧,浆,蒋,桨,奖,讲,酱,胶,浇,骄,娇,搅,铰,矫,侥,脚,饺,缴,绞,轿,较,秸,阶,节,茎,惊,经,颈,静,镜,径,痉,竞,净,纠,厩,旧,驹,举,据,锯,惧,剧,鹃,绢,杰,洁,结,诫,届,紧,锦,仅,谨,进,晋,烬,尽,劲,荆,觉,决,诀,绝,钧,军,骏,开,凯,颗,壳,课,垦,恳,抠,库,裤,夸,块,侩,宽,矿,旷,况,亏,岿,窥,馈,溃,扩,阔,蜡,腊,莱,来,赖,蓝,栏,拦,篮,阑,兰,澜,谰,揽,览,懒,缆,烂,滥,捞,劳,涝,乐,镭,垒,类,泪,篱,离,里,鲤,礼,丽,厉,励,砾,历,沥,隶,俩,联,莲,连,镰,怜,涟,帘,敛,脸,链,恋,炼,练,粮,凉,两,辆,谅,疗,辽,镣,猎,临,邻,鳞,凛,赁,龄,铃,凌,灵,岭,领,馏,刘,龙,聋,咙,笼,垄,拢,陇,楼,娄,搂,篓,芦,卢,颅,庐,炉,掳,卤,虏,鲁,赂,禄,录,陆,驴,吕,铝,侣,屡,缕,虑,滤,绿,峦,挛,孪,滦,乱,抡,轮,伦,仑,沦,纶,论,萝,罗,逻,锣,箩,骡,骆,络,妈,玛,码,蚂,马,骂,吗,买,麦,卖,迈,脉,瞒,馒,蛮,满,谩,猫,锚,铆,贸,么,霉,没,镁,门,闷,们,锰,梦,谜,弥,觅,绵,缅,庙,灭,悯,闽,鸣,铭,谬,谋,亩,钠,纳,难,挠,脑,恼,闹,馁,腻,撵,捻,酿,鸟,聂,啮,镊,镍,柠,狞,宁,拧,泞,钮,纽,脓,浓,农,疟,诺,欧,鸥,殴,呕,沤,盘,庞,国,爱,赔,喷,鹏,骗,飘,频,贫,苹,凭,评,泼,颇,扑,铺,朴,谱,脐,齐,骑,岂,启,气,弃,讫,牵,扦,钎,铅,迁,签,谦,钱,钳,潜,浅,谴,堑,枪,呛,墙,蔷,强,抢,锹,桥,乔,侨,翘,窍,窃,钦,亲,轻,氢,倾,顷,请,庆,琼,穷,趋,区,躯,驱,龋,颧,权,劝,却,鹊,让,饶,扰,绕,热,韧,认,纫,荣,绒,软,锐,闰,润,洒,萨,鳃,赛,伞,丧,骚,扫,涩,杀,纱,筛,晒,闪,陕,赡,缮,伤,赏,烧,绍,赊,摄,慑,设,绅,审,婶,肾,渗,声,绳,胜,圣,师,狮,湿,诗,尸,时,蚀,实,识,驶,势,释,饰,视,试,寿,兽,枢,输,书,赎,属,术,树,竖,数,帅,双,谁,税,顺,说,硕,烁,丝,饲,耸,怂,颂,讼,诵,擞,苏,诉,肃,虽,绥,岁,孙,损,笋,缩,琐,锁,獭,挞,抬,摊,贪,瘫,滩,坛,谭,谈,叹,汤,烫,涛,绦,腾,誊,锑,题,体,屉,条,贴,铁,厅,听,烃,铜,统,头,图,涂,团,颓,蜕,脱,鸵,驮,驼,椭,洼,袜,弯,湾,顽,万,网,韦,违,围,为,潍,维,苇,伟,伪,纬,谓,卫,温,闻,纹,稳,问,瓮,挝,蜗,涡,窝,呜,钨,乌,诬,无,芜,吴,坞,雾,务,误,锡,牺,袭,习,铣,戏,细,虾,辖,峡,侠,狭,厦,锨,鲜,纤,咸,贤,衔,闲,显,险,现,献,县,馅,羡,宪,线,厢,镶,乡,详,响,项,萧,销,晓,啸,蝎,协,挟,携,胁,谐,写,泻,谢,锌,衅,兴,汹,锈,绣,虚,嘘,须,许,绪,续,轩,悬,选,癣,绚,学,勋,询,寻,驯,训,讯,逊,压,鸦,鸭,哑,亚,讶,阉,烟,盐,严,颜,阎,艳,厌,砚,彦,谚,验,鸯,杨,扬,疡,痒,养,样,瑶,摇,尧,遥,窑,谣,药,爷,页,业,叶,医,铱,颐,遗,仪,彝,蚁,艺,亿,忆,义,诣,议,谊,译,异,绎,荫,阴,银,饮,樱,婴,鹰,应,缨,莹,萤,营,荧,蝇,颖,哟,拥,佣,痈,踊,咏,涌,优,忧,邮,铀,犹,游,诱,舆,鱼,渔,娱,与,屿,语,吁,御,狱,誉,预,驭,鸳,渊,辕,园,员,圆,缘,远,愿,约,跃,钥,岳,粤,悦,阅,云,郧,匀,陨,运,蕴,酝,晕,韵,杂,灾,载,攒,暂,赞,赃,脏,凿,枣,灶,责,择,则,泽,贼,赠,扎,札,轧,铡,闸,诈,斋,债,毡,盏,斩,辗,崭,栈,战,绽,张,涨,帐,账,胀,赵,蛰,辙,锗,这,贞,针,侦,诊,镇,阵,挣,睁,狰,帧,郑,证,织,职,执,纸,挚,掷,帜,质,钟,终,种,肿,众,诌,轴,皱,昼,骤,猪,诸,诛,烛,瞩,嘱,贮,铸,筑,驻,专,砖,转,赚,桩,庄,装,妆,壮,状,锥,赘,坠,缀,谆,浊,兹,资,渍,踪,综,总,纵,邹,诅,组,钻,致,钟,么,为,只,凶,准,启,板,里,雳,余,链,泄";

    $t="陽,皚,藹,礙,愛,翺,襖,奧,壩,罷,擺,敗,頒,辦,絆,幫,綁,鎊,謗,剝,飽,寶,報,鮑,輩,貝,鋇,狽,備,憊,繃,筆,畢,斃,閉,邊,編,貶,變,辯,辮,鼈,癟,瀕,濱,賓,擯,餅,撥,缽,鉑,駁,蔔,補,參,蠶,殘,慚,慘,燦,蒼,艙,倉,滄,廁,側,冊,測,層,詫,攙,摻,蟬,饞,讒,纏,鏟,産,闡,顫,場,嘗,長,償,腸,廠,暢,鈔,車,徹,塵,陳,襯,撐,稱,懲,誠,騁,癡,遲,馳,恥,齒,熾,沖,蟲,寵,疇,躊,籌,綢,醜,櫥,廚,鋤,雛,礎,儲,觸,處,傳,瘡,闖,創,錘,純,綽,辭,詞,賜,聰,蔥,囪,從,叢,湊,竄,錯,達,帶,貸,擔,單,鄲,撣,膽,憚,誕,彈,當,擋,黨,蕩,檔,搗,島,禱,導,盜,燈,鄧,敵,滌,遞,締,點,墊,電,澱,釣,調,叠,諜,疊,釘,頂,錠,訂,東,動,棟,凍,鬥,犢,獨,讀,賭,鍍,鍛,斷,緞,兌,隊,對,噸,頓,鈍,奪,鵝,額,訛,惡,餓,兒,爾,餌,貳,發,罰,閥,琺,礬,釩,煩,範,販,飯,訪,紡,飛,廢,費,紛,墳,奮,憤,糞,豐,楓,鋒,風,瘋,馮,縫,諷,鳳,膚,輻,撫,輔,賦,複,負,訃,婦,縛,該,鈣,蓋,幹,趕,稈,贛,岡,剛,鋼,綱,崗,臯,鎬,擱,鴿,閣,鉻,個,給,龔,宮,鞏,貢,鈎,溝,構,購,夠,蠱,顧,剮,關,觀,館,慣,貫,廣,規,矽,歸,龜,閨,軌,詭,櫃,貴,劊,輥,滾,鍋,國,過,駭,韓,漢,閡,鶴,賀,橫,轟,鴻,紅,後,壺,護,滬,戶,嘩,華,畫,劃,話,懷,壞,歡,環,還,緩,換,喚,瘓,煥,渙,黃,謊,揮,輝,毀,賄,穢,會,燴,彙,諱,誨,繪,葷,渾,夥,獲,貨,禍,擊,機,積,饑,譏,雞,績,緝,極,輯,級,擠,幾,薊,劑,濟,計,記,際,繼,紀,夾,莢,頰,賈,鉀,價,駕,殲,監,堅,箋,間,艱,緘,繭,檢,堿,鹼,揀,撿,簡,儉,減,薦,檻,鑒,踐,賤,見,鍵,艦,劍,餞,漸,濺,澗,漿,蔣,槳,獎,講,醬,膠,澆,驕,嬌,攪,鉸,矯,僥,腳,餃,繳,絞,轎,較,稭,階,節,莖,驚,經,頸,靜,鏡,徑,痙,競,淨,糾,廄,舊,駒,舉,據,鋸,懼,劇,鵑,絹,傑,潔,結,誡,屆,緊,錦,僅,謹,進,晉,燼,盡,勁,荊,覺,決,訣,絕,鈞,軍,駿,開,凱,顆,殼,課,墾,懇,摳,庫,褲,誇,塊,儈,寬,礦,曠,況,虧,巋,窺,饋,潰,擴,闊,蠟,臘,萊,來,賴,藍,欄,攔,籃,闌,蘭,瀾,讕,攬,覽,懶,纜,爛,濫,撈,勞,澇,樂,鐳,壘,類,淚,籬,離,裏,鯉,禮,麗,厲,勵,礫,曆,瀝,隸,倆,聯,蓮,連,鐮,憐,漣,簾,斂,臉,鏈,戀,煉,練,糧,涼,兩,輛,諒,療,遼,鐐,獵,臨,鄰,鱗,凜,賃,齡,鈴,淩,靈,嶺,領,餾,劉,龍,聾,嚨,籠,壟,攏,隴,樓,婁,摟,簍,蘆,盧,顱,廬,爐,擄,鹵,虜,魯,賂,祿,錄,陸,驢,呂,鋁,侶,屢,縷,慮,濾,綠,巒,攣,孿,灤,亂,掄,輪,倫,侖,淪,綸,論,蘿,羅,邏,鑼,籮,騾,駱,絡,媽,瑪,碼,螞,馬,罵,嗎,買,麥,賣,邁,脈,瞞,饅,蠻,滿,謾,貓,錨,鉚,貿,麽,黴,沒,鎂,門,悶,們,錳,夢,謎,彌,覓,綿,緬,廟,滅,憫,閩,鳴,銘,謬,謀,畝,鈉,納,難,撓,腦,惱,鬧,餒,膩,攆,撚,釀,鳥,聶,齧,鑷,鎳,檸,獰,甯,擰,濘,鈕,紐,膿,濃,農,瘧,諾,歐,鷗,毆,嘔,漚,盤,龐,國,愛,賠,噴,鵬,騙,飄,頻,貧,蘋,憑,評,潑,頗,撲,鋪,樸,譜,臍,齊,騎,豈,啓,氣,棄,訖,牽,扡,釺,鉛,遷,簽,謙,錢,鉗,潛,淺,譴,塹,槍,嗆,牆,薔,強,搶,鍬,橋,喬,僑,翹,竅,竊,欽,親,輕,氫,傾,頃,請,慶,瓊,窮,趨,區,軀,驅,齲,顴,權,勸,卻,鵲,讓,饒,擾,繞,熱,韌,認,紉,榮,絨,軟,銳,閏,潤,灑,薩,鰓,賽,傘,喪,騷,掃,澀,殺,紗,篩,曬,閃,陝,贍,繕,傷,賞,燒,紹,賒,攝,懾,設,紳,審,嬸,腎,滲,聲,繩,勝,聖,師,獅,濕,詩,屍,時,蝕,實,識,駛,勢,釋,飾,視,試,壽,獸,樞,輸,書,贖,屬,術,樹,豎,數,帥,雙,誰,稅,順,說,碩,爍,絲,飼,聳,慫,頌,訟,誦,擻,蘇,訴,肅,雖,綏,歲,孫,損,筍,縮,瑣,鎖,獺,撻,擡,攤,貪,癱,灘,壇,譚,談,歎,湯,燙,濤,縧,騰,謄,銻,題,體,屜,條,貼,鐵,廳,聽,烴,銅,統,頭,圖,塗,團,頹,蛻,脫,鴕,馱,駝,橢,窪,襪,彎,灣,頑,萬,網,韋,違,圍,爲,濰,維,葦,偉,僞,緯,謂,衛,溫,聞,紋,穩,問,甕,撾,蝸,渦,窩,嗚,鎢,烏,誣,無,蕪,吳,塢,霧,務,誤,錫,犧,襲,習,銑,戲,細,蝦,轄,峽,俠,狹,廈,鍁,鮮,纖,鹹,賢,銜,閑,顯,險,現,獻,縣,餡,羨,憲,線,廂,鑲,鄉,詳,響,項,蕭,銷,曉,嘯,蠍,協,挾,攜,脅,諧,寫,瀉,謝,鋅,釁,興,洶,鏽,繡,虛,噓,須,許,緒,續,軒,懸,選,癬,絢,學,勳,詢,尋,馴,訓,訊,遜,壓,鴉,鴨,啞,亞,訝,閹,煙,鹽,嚴,顔,閻,豔,厭,硯,彥,諺,驗,鴦,楊,揚,瘍,癢,養,樣,瑤,搖,堯,遙,窯,謠,藥,爺,頁,業,葉,醫,銥,頤,遺,儀,彜,蟻,藝,億,憶,義,詣,議,誼,譯,異,繹,蔭,陰,銀,飲,櫻,嬰,鷹,應,纓,瑩,螢,營,熒,蠅,穎,喲,擁,傭,癰,踴,詠,湧,優,憂,郵,鈾,猶,遊,誘,輿,魚,漁,娛,與,嶼,語,籲,禦,獄,譽,預,馭,鴛,淵,轅,園,員,圓,緣,遠,願,約,躍,鑰,嶽,粵,悅,閱,雲,鄖,勻,隕,運,蘊,醞,暈,韻,雜,災,載,攢,暫,贊,贓,髒,鑿,棗,竈,責,擇,則,澤,賊,贈,紮,劄,軋,鍘,閘,詐,齋,債,氈,盞,斬,輾,嶄,棧,戰,綻,張,漲,帳,賬,脹,趙,蟄,轍,鍺,這,貞,針,偵,診,鎮,陣,掙,睜,猙,幀,鄭,證,織,職,執,紙,摯,擲,幟,質,鍾,終,種,腫,衆,謅,軸,皺,晝,驟,豬,諸,誅,燭,矚,囑,貯,鑄,築,駐,專,磚,轉,賺,樁,莊,裝,妝,壯,狀,錐,贅,墜,綴,諄,濁,茲,資,漬,蹤,綜,總,縱,鄒,詛,組,鑽,緻,鐘,麼,為,隻,兇,準,啟,闆,裡,靂,餘,鍊,洩";

    $s=explode(",", $s);
    $t=explode(",", $t);
    $content=str_replace($s, $t, $content);

    return $content;
}


